# CRÉATION D'UNE BASE DE DONNÉES ALÉATOIRE SUR LES RESTAURANTS

In [1]:
import pandas as pd
import random as rd
import datetime as dt

from db import create_db

create_db()

Base de données bronze supprimée.
Pas de base de données argent.
2022-12-13 16:43:43,883 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:43,884 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Pays")
2022-12-13 16:43:43,885 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,887 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Pays")
2022-12-13 16:43:43,888 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,889 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Restaurant")
2022-12-13 16:43:43,890 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,892 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Restaurant")
2022-12-13 16:43:43,893 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,894 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Employee")
2022-12-13 16:43:43,895 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,896 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Employee")
2022-12-13 16:43:43,897 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,899 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Rib")
2022-12-13 16:43:43,900 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,901 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Rib")
2022-12-13 16:43:43,902 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,903 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Paie")
2022-12-13 16:43:43,904 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,906 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Paie")
2022-12-13 16:43:43,906 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,908 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("CarteMenu")
2022-12-13 16:43:43,912 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,913 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("CarteMenu")
2022-12-13 16:43:43,914 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,915 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Menu")
2022-12-13 16:43:43,916 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,918 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Menu")
2022-12-13 16:43:43,918 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,919 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Item")
2022-12-13 16:43:43,920 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,922 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Item")
2022-12-13 16:43:43,924 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,925 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("CarteItem")
2022-12-13 16:43:43,926 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,927 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("CarteItem")
2022-12-13 16:43:43,928 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,929 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("PanierMenu")
2022-12-13 16:43:43,931 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,933 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("PanierMenu")
2022-12-13 16:43:43,934 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,936 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("PanierItem")
2022-12-13 16:43:43,938 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,939 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("PanierItem")
2022-12-13 16:43:43,940 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,941 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Bill")
2022-12-13 16:43:43,942 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,944 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Bill")
2022-12-13 16:43:43,945 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,946 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Recette")
2022-12-13 16:43:43,947 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,949 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Recette")
2022-12-13 16:43:43,950 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,951 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Ingredient")
2022-12-13 16:43:43,952 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,954 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Ingredient")
2022-12-13 16:43:43,955 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,956 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Stock")
2022-12-13 16:43:43,957 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,959 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Stock")
2022-12-13 16:43:43,959 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:43,961 INFO sqlalchemy.engine.Engine
CREATE TABLE "Pays" (
	pays VARCHAR(255) NOT NULL,
	PRIMARY KEY (pays)
)


2022-12-13 16:43:43,962 INFO sqlalchemy.engine.Engine [no key 0.00097s] ()
2022-12-13 16:43:43,971 INFO sqlalchemy.engine.Engine
CREATE TABLE "Item" (
	nom_item VARCHAR NOT NULL,
	type VARCHAR NOT NULL,
	prix FLOAT NOT NULL,
	PRIMARY KEY (nom_item)
)


2022-12-13 16:43:43,971 INFO sqlalchemy.engine.Engine [no key 0.00081s] ()
2022-12-13 16:43:43,978 INFO sqlalchemy.engine.Engine
CREATE TABLE "Ingredient" (
	ingredient VARCHAR NOT NULL,
	prix FLOAT NOT NULL,
	PRIMARY KEY (ingredient)
)


2022-12-13 16:43:43,979 INFO sqlalchemy.engine.Engine [no key 0.00101s] ()
2022-12-13 16:43:43,985 INFO sqlalchemy.engine.Engine
CREATE TABLE "Restaurant" (
	code_postal VARCHAR(255) NOT NULL,
	pays VARCHAR(255),
	capacite INTEGER,
	espace_enfant INTEGER,
	service_rapide INTEGER,
	parking INTEGER,
	accessibilite INTEGER,
	PRIMARY KEY (code_postal),
	FOREIGN KEY(pays) REFERENCES "Pays" (pays)
)


2022-12-13 16:43:43,986 INFO sqlalchemy.engine.Engine [no key 0.00103s] ()
2022-12-13 16:43:43,992 INFO sqlalchemy.engine.Engine
CREATE TABLE "Menu" (
	id_menu INTEGER NOT NULL,
	boisson VARCHAR NOT NULL,
	plat VARCHAR NOT NULL,
	dessert VARCHAR NOT NULL,
	prix FLOAT NOT NULL,
	PRIMARY KEY (id_menu),
	FOREIGN KEY(boisson) REFERENCES "Item" (nom_item),
	FOREIGN KEY(plat) REFERENCES "Item" (nom_item),
	FOREIGN KEY(dessert) REFERENCES "Item" (nom_item)
)


2022-12-13 16:43:43,993 INFO sqlalchemy.engine.Engine [no key 0.00090s] ()
2022-12-13 16:43:44,000 INFO sqlalchemy.engine.Engine
CREATE TABLE "CarteItem" (
	pays INTEGER NOT NULL,
	id_item INTEGER NOT NULL,
	PRIMARY KEY (pays, id_item),
	FOREIGN KEY(pays) REFERENCES "Pays" (pays),
	FOREIGN KEY(id_item) REFERENCES "Item" (nom_item)
)


2022-12-13 16:43:44,001 INFO sqlalchemy.engine.Engine [no key 0.00090s] ()
2022-12-13 16:43:44,008 INFO sqlalchemy.engine.Engine
CREATE TABLE "Recette" (
	nom_item VARCHAR NOT NULL,
	ingredient VARCHAR NOT NULL,
	"quantité" INTEGER NOT NULL,
	PRIMARY KEY (nom_item, ingredient),
	FOREIGN KEY(nom_item) REFERENCES "Item" (nom_item),
	FOREIGN KEY(ingredient) REFERENCES "Ingredient" (ingredient)
)


2022-12-13 16:43:44,009 INFO sqlalchemy.engine.Engine [no key 0.00092s] ()
2022-12-13 16:43:44,016 INFO sqlalchemy.engine.Engine
CREATE TABLE "Employee" (
	id_employee INTEGER NOT NULL,
	code_postal VARCHAR(200),
	poste VARCHAR(200) NOT NULL,
	nom VARCHAR(200) NOT NULL,
	adresse VARCHAR(200) NOT NULL,
	note INTEGER,
	experience DATETIME,
	PRIMARY KEY (id_employee),
	FOREIGN KEY(code_postal) REFERENCES "Restaurant" (code_postal)
)


2022-12-13 16:43:44,017 INFO sqlalchemy.engine.Engine [no key 0.00086s] ()
2022-12-13 16:43:44,024 INFO sqlalchemy.engine.Engine
CREATE TABLE "CarteMenu" (
	pays INTEGER NOT NULL,
	id_menu INTEGER NOT NULL,
	PRIMARY KEY (pays, id_menu),
	FOREIGN KEY(pays) REFERENCES "Pays" (pays),
	FOREIGN KEY(id_menu) REFERENCES "Menu" (id_menu)
)


2022-12-13 16:43:44,025 INFO sqlalchemy.engine.Engine [no key 0.00097s] ()
2022-12-13 16:43:44,032 INFO sqlalchemy.engine.Engine
CREATE TABLE "Stock" (
	ingredient VARCHAR NOT NULL,
	code_postal VARCHAR NOT NULL,
	"quantité" INTEGER,
	PRIMARY KEY (ingredient, code_postal),
	FOREIGN KEY(ingredient) REFERENCES "Ingredient" (ingredient),
	FOREIGN KEY(code_postal) REFERENCES "Restaurant" (code_postal)
)


2022-12-13 16:43:44,033 INFO sqlalchemy.engine.Engine [no key 0.00096s] ()
2022-12-13 16:43:44,039 INFO sqlalchemy.engine.Engine
CREATE TABLE "Rib" (
	id_employee INTEGER NOT NULL,
	iban VARCHAR(255) NOT NULL,
	bic VARCHAR NOT NULL,
	"propriètaire" VARCHAR NOT NULL,
	adresse VARCHAR NOT NULL,
	PRIMARY KEY (id_employee),
	FOREIGN KEY(id_employee) REFERENCES "Employee" (id_employee)
)


2022-12-13 16:43:44,040 INFO sqlalchemy.engine.Engine [no key 0.00095s] ()
2022-12-13 16:43:44,046 INFO sqlalchemy.engine.Engine
CREATE TABLE "Paie" (
	id_employee INTEGER NOT NULL,
	date VARCHAR NOT NULL,
	salaire_net FLOAT NOT NULL,
	PRIMARY KEY (id_employee),
	FOREIGN KEY(id_employee) REFERENCES "Employee" (id_employee)
)


2022-12-13 16:43:44,047 INFO sqlalchemy.engine.Engine [no key 0.00096s] ()
2022-12-13 16:43:44,053 INFO sqlalchemy.engine.Engine
CREATE TABLE "Bill" (
	id_bill INTEGER NOT NULL,
	code_postal VARCHAR(255) NOT NULL,
	id_vendeur INTEGER NOT NULL,
	moyen_paiement VARCHAR NOT NULL,
	borne INTEGER NOT NULL,
	prix_total FLOAT NOT NULL,
	PRIMARY KEY (id_bill),
	FOREIGN KEY(code_postal) REFERENCES "Restaurant" (code_postal),
	FOREIGN KEY(id_vendeur) REFERENCES "Employee" (id_employee)
)


2022-12-13 16:43:44,054 INFO sqlalchemy.engine.Engine [no key 0.00098s] ()
2022-12-13 16:43:44,060 INFO sqlalchemy.engine.Engine
CREATE TABLE "PanierMenu" (
	id_bill INTEGER NOT NULL,
	id_menu INTEGER NOT NULL,
	"quantité" INTEGER NOT NULL,
	PRIMARY KEY (id_bill, id_menu),
	FOREIGN KEY(id_bill) REFERENCES "Bill" (id_bill),
	FOREIGN KEY(id_menu) REFERENCES "Menu" (id_menu)
)


2022-12-13 16:43:44,061 INFO sqlalchemy.engine.Engine [no key 0.00114s] ()
2022-12-13 16:43:44,067 INFO sqlalchemy.engine.Engine
CREATE TABLE "PanierItem" (
	nom_item VARCHAR NOT NULL,
	id_bill INTEGER NOT NULL,
	"quantité" INTEGER NOT NULL,
	PRIMARY KEY (nom_item, id_bill),
	FOREIGN KEY(nom_item) REFERENCES "Item" (nom_item),
	FOREIGN KEY(id_bill) REFERENCES "Bill" (id_bill)
)


2022-12-13 16:43:44,069 INFO sqlalchemy.engine.Engine [no key 0.00120s] ()
2022-12-13 16:43:44,074 INFO sqlalchemy.engine.Engine COMMIT

In [2]:
from db import engine

import os

import faker

fake = faker.Faker()

## RESTAURANTS

In [3]:
df_resto = pd.read_csv("csv/data_resto.csv")

df_resto

,code_postal,pays,capacite,espace_enfant,service_rapide,parking,accessibilite
0,24-13,United States,247,No,No,No,Yes
1,G27 7HT,South Africa,96,Yes,Yes,No,No
2,7443 YD,Colombia,68,Yes,No,Yes,Yes
3,93956-418,Vietnam,181,No,No,Yes,Yes
4,977145,Italy,75,No,No,No,No
...,...,...,...,...,...,...,...
245,183227,Turkey,126,No,Yes,Yes,No
246,8563,Germany,135,Yes,Yes,Yes,Yes
247,21354,Italy,63,No,No,No,No
248,4460,Pakistan,135,Yes,No,Yes,Yes
249,7363,Peru,198,Yes,Yes,Yes,Yes

In [4]:
df_resto["espace_enfant"] = df_resto["espace_enfant"].apply(lambda x: 1 if x == "Yes" else x)
df_resto["espace_enfant"] = df_resto["espace_enfant"].apply(lambda x: 0 if x == "No" else x)

df_resto["service_rapide"] = df_resto["service_rapide"].apply(lambda x: 1 if x == "Yes" else x)
df_resto["service_rapide"] = df_resto["service_rapide"].apply(lambda x: 0 if x == "No" else x)

df_resto["parking"] = df_resto["parking"].apply(lambda x: 1 if x == "Yes" else x)
df_resto["parking"] = df_resto["parking"].apply(lambda x: 0 if x == "No" else x)

df_resto["accessibilite"] = df_resto["accessibilite"].apply(lambda x: 1 if x == "Yes" else x)
df_resto["accessibilite"] = df_resto["accessibilite"].apply(lambda x: 0 if x == "No" else x)

df_resto

,code_postal,pays,capacite,espace_enfant,service_rapide,parking,accessibilite
0,24-13,United States,247,0,0,0,1
1,G27 7HT,South Africa,96,1,1,0,0
2,7443 YD,Colombia,68,1,0,1,1
3,93956-418,Vietnam,181,0,0,1,1
4,977145,Italy,75,0,0,0,0
...,...,...,...,...,...,...,...
245,183227,Turkey,126,0,1,1,0
246,8563,Germany,135,1,1,1,1
247,21354,Italy,63,0,0,0,0
248,4460,Pakistan,135,1,0,1,1
249,7363,Peru,198,1,1,1,1

In [5]:
df_resto.groupby("pays").count()

,code_postal,capacite,espace_enfant,service_rapide,parking,accessibilite
pays,,,,,,
Australia,7,7,7,7,7,7
Austria,5,5,5,5,5,5
Belgium,9,9,9,9,9,9
Brazil,9,9,9,9,9,9
Canada,5,5,5,5,5,5
Chile,7,7,7,7,7,7
China,13,13,13,13,13,13
Colombia,5,5,5,5,5,5
Costa Rica,6,6,6,6,6,6
France,9,9,9,9,9,9
Germany,7,7,7,7,7,7
India,7,7,7,7,7,7
Indonesia,4,4,4,4,4,4
Ireland,7,7,7,7,7,7
Italy,9,9,9,9,9,9
Mexico,4,4,4,4,4,4
Netherlands,5,5,5,5,5,5
New Zealand,9,9,9,9,9,9
Nigeria,5,5,5,5,5,5
Norway,11,11,11,11,11,11
Pakistan,10,10,10,10,10,10
Peru,9,9,9,9,9,9
Philippines,7,7,7,7,7,7
Poland,10,10,10,10,10,10
Russian Federation,4,4,4,4,4,4
Singapore,6,6,6,6,6,6
South Africa,5,5,5,5,5,5
South Korea,5,5,5,5,5,5
Spain,11,11,11,11,11,11
Turkey,5,5,5,5,5,5
Ukraine,6,6,6,6,6,6
United Kingdom,8,8,8,8,8,8
United States,6,6,6,6,6,6
Vietnam,15,15,15,15,15,15

In [6]:
df_resto["pays"].nunique()

34

## EMPLOYÉS

##### Création de la liste des employés.

In [7]:
code_postal = df_resto["code_postal"].unique()

code_postal

array(['24-13', 'G27 7HT', '7443 YD', '93956-418', '977145', '29552',
       '45331', '18345', '85-710', '8876 JU', '164486', '547166',
       '327537', '3348', '9318', '762070', '53782', '0381', '244443',
       'WV2H 3LD', '153293', '3004', '791811', '253842', '2518', '95865',
       '37815', '362232', '656964', '54-74', '8235', '20284', '1782',
       '171674', '788735', 'L17 8DW', '25655', '73873', '11111', '48617',
       '22751', '50211', 'YR9V 4GY', '14958', '1943 QJ', '52104',
       '65814-592', '25874', '8323', '58352', '06-728', '6162-4288',
       '741637', '221896', '138261', '42074', '41-681', '569842', '27451',
       '37348978', '236181', '8584', '452654', '604113', '3685 KV',
       '76863', '851789', '269276', '72670', '8287', '4430', 'L3 4RS',
       '2296', '2758', '2246-7768', '6144', '13275', '19424', '7221',
       '425464', '71277', '732429', '89-018', '3344', '20609', '744636',
       '4350', '66835', 'd1R 4E2', '5246', '4628', '18037', '0983 VX',
       '97-88', '065836', '77-785', '6580 XR', '30017', '488072',
       '273233', '3054', '776532', '427450', '06-887', '33676', '25753',
       '867306', '01779', '85610-271', 'Z4W 2M7', '462769', '38-056',
       '7972 KG', '55119', '8341-1818', '5459', '63177', '59-971',
       '12737', '551150', '1522', '40617', '7072', '12508', '24-028',
       '68404', '9824-6784', '282669', '74180', '143835', '387876',
       '0885', '11626', '12727-178', '7323', '65424-673', '5799 NY',
       'Y8J 3E0', '51274', '42763', '02653', '17914', '31-566', '82868',
       'I7A 6X7', '922222', 'S8J 5V6', '4434', '875507', '54167',
       '6238-0297', '52W 8A3', '85524', '605151', '1617', '11827',
       '62428', '47803', '540245', '7819', '8481 KH', '60708', '21071',
       '12177', '10114', '26320', '245267', '6479', '3970', '87312',
       '1165 PU', '34486', '3373-5558', '93870', '54255-33164', '874143',
       '536434', '43042', '377428', '817512', '621964', '7572', '30406',
       '70166-53314', '2228', '265237', 'IY6C 1ZY', '54961', '0557',
       '38978', '87406', '50114', '6438-3664', '552771', '431951',
       'K1V 3IR', '2169', '21821', '23628', '765583', '4120', '19411',
       '733991', '30907', '741185', '55204', '440731', '96-15', '16213',
       '26625', '180648', '08-175', '67081', '2883', '2274', '583125',
       '66182-047', '81745', '16995', '76-184', '23012', '3621', '68846',
       '52395', '58254', '8187-7766', '7447', '812346', '20353', '868106',
       '41773', '57418', '552576', '67196-66612', '7615', '6738',
       '9918 DE', '50263', '17-915', '72795', '12122', '886836', '3725',
       '8546', '257126', '183227', '8563', '21354', '4460', '7363'],
      dtype=object)

In [8]:
len(code_postal)

250

In [9]:
df_employes = pd.read_csv("csv/data_employes.csv")

df_employes['id_employee'] = df_employes.index
df_employes['code_postal'] = ''

df_employes['code_postal'] = df_employes['code_postal'].apply(lambda x : code_postal[rd.randint(0, len(code_postal)-1)])
del df_employes['telephone']
del df_employes['email']

df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318
...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479

In [10]:
df_employes.count()

nom            3645
adresse        3645
experience     3645
poste          3645
note           3000
id_employee    3645
code_postal    3645
dtype: int64

In [11]:
df_employes.groupby("poste").count()

            nom  adresse  experience  note  id_employee  code_postal
poste
caissier   1000     1000        1000  1000         1000         1000
cuisinier  2000     2000        2000  2000         2000         2000
directeur   245      245         245     0          245          245
manager     400      400         400     0          400          400

## PAYS

In [12]:
list_pays_block = [df_resto["pays"].unique()]
list_pays = df_resto["pays"].unique()

list_pays

array(['United States', 'South Africa', 'Colombia', 'Vietnam', 'Italy',
       'Ireland', 'China', 'France', 'Peru', 'New Zealand', 'Spain',
       'Brazil', 'Australia', 'Austria', 'Pakistan', 'Poland', 'Canada',
       'Costa Rica', 'Mexico', 'Philippines', 'Indonesia', 'Ukraine',
       'Turkey', 'Singapore', 'Nigeria', 'Chile', 'Norway', 'South Korea',
       'United Kingdom', 'Netherlands', 'India', 'Belgium', 'Germany',
       'Russian Federation'], dtype=object)

In [13]:
len(list_pays)

34

In [14]:
df_pays = pd.DataFrame()

for pays in range(len(list_pays_block)):
    df_pays["pays"] = list_pays_block[pays]
    
df_pays

                  pays
0        United States
1         South Africa
2             Colombia
3              Vietnam
4                Italy
5              Ireland
6                China
7               France
8                 Peru
9          New Zealand
10               Spain
11              Brazil
12           Australia
13             Austria
14            Pakistan
15              Poland
16              Canada
17          Costa Rica
18              Mexico
19         Philippines
20           Indonesia
21             Ukraine
22              Turkey
23           Singapore
24             Nigeria
25               Chile
26              Norway
27         South Korea
28      United Kingdom
29         Netherlands
30               India
31             Belgium
32             Germany
33  Russian Federation

## INGRÉDIENTS

Ingrédients pour les plats

In [15]:
df_ingredient_plat = pd.DataFrame({
    "ingredient": ["pain", "steak", "nugguet", "fish", "salade", "tomate", "cornichon", "s_mayo", "s_ketchup", "s_barbecue", "fromage"], 
    "prix": [0.49, 0.99, 1.19, 1.49, 0.29, 0.29, 0.09, 0.19, 0.19, 0.19, 0.39]
    })

df_ingredient_plat

    ingredient  prix
0         pain  0.49
1        steak  0.99
2      nugguet  1.19
3         fish  1.49
4       salade  0.29
5       tomate  0.29
6    cornichon  0.09
7       s_mayo  0.19
8    s_ketchup  0.19
9   s_barbecue  0.19
10     fromage  0.39

Ingrédients pour les desserts

In [16]:
df_fruit = pd.DataFrame({
    "ingredient": ["banane", "pomme", "orange"], 
    "prix": [0.99, 0.49, 0.49]
    })

df_fruit

  ingredient  prix
0     banane  0.99
1      pomme  0.49
2     orange  0.49

In [17]:
df_glace = pd.DataFrame({
    "ingredient": ["glace_van", "glace_choco", "glace_pist"], 
    "prix": [0.69, 0.99, 0.99]
    })

df_glace

    ingredient  prix
0    glace_van  0.69
1  glace_choco  0.99
2   glace_pist  0.99

In [18]:
df_sauce = pd.DataFrame({
    "ingredient": ["s_choco", "s_caramel", "s_café", "croustille"], 
    "prix": [0.19, 0.19, 0.19, 0.09]
    })

df_sauce

   ingredient  prix
0     s_choco  0.19
1   s_caramel  0.19
2      s_café  0.19
3  croustille  0.09

In [19]:
df_ingredient_dessert = pd.concat([df_fruit, df_glace, df_sauce]).reset_index()
del df_ingredient_dessert['index']

df_ingredient_dessert

    ingredient  prix
0       banane  0.99
1        pomme  0.49
2       orange  0.49
3    glace_van  0.69
4  glace_choco  0.99
5   glace_pist  0.99
6      s_choco  0.19
7    s_caramel  0.19
8       s_café  0.19
9   croustille  0.09

In [20]:
df_ingredient = pd.concat([df_ingredient_plat, df_ingredient_dessert]).set_index("ingredient")

df_ingredient

             prix
ingredient
pain         0.49
steak        0.99
nugguet      1.19
fish         1.49
salade       0.29
tomate       0.29
cornichon    0.09
s_mayo       0.19
s_ketchup    0.19
s_barbecue   0.19
fromage      0.39
banane       0.99
pomme        0.49
orange       0.49
glace_van    0.69
glace_choco  0.99
glace_pist   0.99
s_choco      0.19
s_caramel    0.19
s_café       0.19
croustille   0.09

In [21]:
len(df_ingredient)

21

In [22]:
df_ingredient.nunique()

prix    9
dtype: int64

## RECETTE

In [23]:
df_ingredient_plat

    ingredient  prix
0         pain  0.49
1        steak  0.99
2      nugguet  1.19
3         fish  1.49
4       salade  0.29
5       tomate  0.29
6    cornichon  0.09
7       s_mayo  0.19
8    s_ketchup  0.19
9   s_barbecue  0.19
10     fromage  0.39

In [24]:
nb_plat = 50
nb_dessert = 50
list_plat = []
list_dessert = []

for plat in range (nb_plat):
    rd_viande = rd.randint(1,3)
    nb_viande = rd.randint(1,2)
    rd_crudites = rd.randint(4,6)
    rd_sauce = rd.randint(7,9)
    nb_fromage = rd.randint(0,3)

    list_plat.append({
        "nom_item": "Plat n°" + str(plat + 1),
        "ingredients": [df_ingredient_plat.ingredient[0], df_ingredient_plat.ingredient[rd_viande], df_ingredient_plat.ingredient[rd_crudites], df_ingredient_plat.ingredient[rd_sauce], df_ingredient_plat.ingredient[10]],
        "prix": round((df_ingredient_plat.prix[0] + nb_viande * df_ingredient_plat.prix[rd_viande] + df_ingredient_plat.prix[rd_crudites] + df_ingredient_plat.prix[rd_sauce]) + nb_fromage *  df_ingredient_plat.prix[10] + 1.49, 2),
        "type": "plat"
    })
    
for dessert in range (nb_dessert):
    rd_fruit = rd.randint(0, len(df_fruit)-1)
    rd_glace = rd.randint(0, len(df_glace)-1)
    rd_sauce = rd.randint(0, 2)
    rd_boule = rd.randint(1, 3)

    list_dessert.append({
        "nom_item": "Dessert n°" + str(dessert + 1),
        "ingredients": [df_fruit.ingredient[rd_fruit], df_glace.ingredient[rd_glace], df_sauce.ingredient[rd_sauce], df_sauce.ingredient[3]],
        "prix": round((df_fruit.prix[rd_fruit] + rd_boule * df_glace.prix[rd_glace] + df_sauce.prix[rd_sauce] + df_sauce.prix[3]) + 0.49, 2),
        "type": "dessert"
    })

list_recette = list_plat + list_dessert

list_recette

[{'nom_item': 'Plat n°1',
  'ingredients': ['pain', 'nugguet', 'salade', 's_ketchup', 'fromage'],
  'prix': 4.84,
  'type': 'plat'},
 {'nom_item': 'Plat n°2',
  'ingredients': ['pain', 'fish', 'salade', 's_mayo', 'fromage'],
  'prix': 5.83,
  'type': 'plat'},
 {'nom_item': 'Plat n°3',
  'ingredients': ['pain', 'fish', 'salade', 's_mayo', 'fromage'],
  'prix': 4.34,
  'type': 'plat'},
 {'nom_item': 'Plat n°4',
  'ingredients': ['pain', 'nugguet', 'salade', 's_barbecue', 'fromage'],
  'prix': 3.65,
  'type': 'plat'},
 {'nom_item': 'Plat n°5',
  'ingredients': ['pain', 'fish', 'cornichon', 's_mayo', 'fromage'],
  'prix': 3.75,
  'type': 'plat'},
 {'nom_item': 'Plat n°6',
  'ingredients': ['pain', 'nugguet', 'cornichon', 's_barbecue', 'fromage'],
  'prix': 4.62,
  'type': 'plat'},
 {'nom_item': 'Plat n°7',
  'ingredients': ['pain', 'fish', 'cornichon', 's_mayo', 'fromage'],
  'prix': 6.02,
  'type': 'plat'},
 {'nom_item': 'Plat n°8',
  'ingredients': ['pain', 'fish', 'tomate', 's_barbecue', 'fromage'],
  'prix': 4.34,
  'type': 'plat'},
 {'nom_item': 'Plat n°9',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°10',
  'ingredients': ['pain', 'steak', 'salade', 's_mayo', 'fromage'],
  'prix': 4.62,
  'type': 'plat'},
 {'nom_item': 'Plat n°11',
  'ingredients': ['pain', 'steak', 'cornichon', 's_mayo', 'fromage'],
  'prix': 4.42,
  'type': 'plat'},
 {'nom_item': 'Plat n°12',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_ketchup', 'fromage'],
  'prix': 4.84,
  'type': 'plat'},
 {'nom_item': 'Plat n°13',
  'ingredients': ['pain', 'steak', 'tomate', 's_mayo', 'fromage'],
  'prix': 5.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°14',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_barbecue', 'fromage'],
  'prix': 4.84,
  'type': 'plat'},
 {'nom_item': 'Plat n°15',
  'ingredients': ['pain', 'steak', 'tomate', 's_ketchup', 'fromage'],
  'prix': 5.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°16',
  'ingredients': ['pain', 'fish', 'cornichon', 's_ketchup', 'fromage'],
  'prix': 4.92,
  'type': 'plat'},
 {'nom_item': 'Plat n°17',
  'ingredients': ['pain', 'nugguet', 'salade', 's_ketchup', 'fromage'],
  'prix': 5.62,
  'type': 'plat'},
 {'nom_item': 'Plat n°18',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.61,
  'type': 'plat'},
 {'nom_item': 'Plat n°19',
  'ingredients': ['pain', 'nugguet', 'salade', 's_mayo', 'fromage'],
  'prix': 4.04,
  'type': 'plat'},
 {'nom_item': 'Plat n°20',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.61,
  'type': 'plat'},
 {'nom_item': 'Plat n°21',
  'ingredients': ['pain', 'fish', 'tomate', 's_ketchup', 'fromage'],
  'prix': 6.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°22',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.01,
  'type': 'plat'},
 {'nom_item': 'Plat n°23',
  'ingredients': ['pain', 'fish', 'salade', 's_ketchup', 'fromage'],
  'prix': 6.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°24',
  'ingredients': ['pain', 'fish', 'salade', 's_barbecue', 'fromage'],
  'prix': 6.61,
  'type': 'plat'},
 {'nom_item': 'Plat n°25',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 4.73,
  'type': 'plat'},
 {'nom_item': 'Plat n°26',
  'ingredients': ['pain', 'fish', 'tomate', 's_ketchup', 'fromage'],
  'prix': 5.83,
  'type': 'plat'},
 {'nom_item': 'Plat n°27',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.61,
  'type': 'plat'},
 {'nom_item': 'Plat n°28',
  'ingredients': ['pain', 'nugguet', 'cornichon', 's_mayo', 'fromage'],
  'prix': 5.03,
  'type': 'plat'},
 {'nom_item': 'Plat n°29',
  'ingredients': ['pain', 'steak', 'salade', 's_mayo', 'fromage'],
  'prix': 4.62,
  'type': 'plat'},
 {'nom_item': 'Plat n°30',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_mayo', 'fromage'],
  'prix': 6.01,
  'type': 'plat'},
 {'nom_item': 'Plat n°31',
  'ingredients': ['pain', 'steak', 'salade', 's_barbecue', 'fromage'],
  'prix': 5.22,
  'type': 'plat'},
 {'nom_item': 'Plat n°32',
  'ingredients': ['pain', 'nugguet', 'salade', 's_ketchup', 'fromage'],
  'prix': 4.82,
  'type': 'plat'},
 {'nom_item': 'Plat n°33',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_mayo', 'fromage'],
  'prix': 4.82,
  'type': 'plat'},
 {'nom_item': 'Plat n°34',
  'ingredients': ['pain', 'nugguet', 'tomate', 's_barbecue', 'fromage'],
  'prix': 4.82,
  'type': 'plat'},
 {'nom_item': 'Plat n°35',
  'ingredients': ['pain', 'nugguet', 'salade', 's_mayo', 'fromage'],
  'prix': 4.82,
  'type': 'plat'},
 {'nom_item': 'Plat n°36',
  'ingredients': ['pain', 'nugguet', 'salade', 's_ketchup', 'fromage'],
  'prix': 4.43,
  'type': 'plat'},
 {'nom_item': 'Plat n°37',
  'ingredients': ['pain', 'nugguet', 'salade', 's_mayo', 'fromage'],
  'prix': 3.65,
  'type': 'plat'},
 {'nom_item': 'Plat n°38',
  'ingredients': ['pain', 'nugguet', 'cornichon', 's_mayo', 'fromage'],
  'prix': 3.45,
  'type': 'plat'},
 {'nom_item': 'Plat n°39',
  'ingredients': ['pain', 'fish', 'cornichon', 's_ketchup', 'fromage'],
  'prix': 5.63,
  'type': 'plat'},
 {'nom_item': 'Plat n°40',
  'ingredients': ['pain', 'fish', 'cornichon', 's_barbecue', 'fromage'],
  'prix': 4.14,
  'type': 'plat'},
 {'nom_item': 'Plat n°41',
  'ingredients': ['pain', 'steak', 'tomate', 's_ketchup', 'fromage'],
  'prix': 4.23,
  'type': 'plat'},
 {'nom_item': 'Plat n°42',
  'ingredients': ['pain', 'nugguet', 'salade', 's_barbecue', 'fromage'],
  'prix': 6.01,
  'type': 'plat'},
 {'nom_item': 'Plat n°43',
  'ingredients': ['pain', 'steak', 'cornichon', 's_mayo', 'fromage'],
  'prix': 4.03,
  'type': 'plat'},
 {'nom_item': 'Plat n°44',
  'ingredients': ['pain', 'fish', 'tomate', 's_ketchup', 'fromage'],
  'prix': 5.44,
  'type': 'plat'},
 {'nom_item': 'Plat n°45',
  'ingredients': ['pain', 'fish', 'cornichon', 's_barbecue', 'fromage'],
  'prix': 4.53,
  'type': 'plat'},
 {'nom_item': 'Plat n°46',
  'ingredients': ['pain', 'fish', 'cornichon', 's_ketchup', 'fromage'],
  'prix': 3.75,
  'type': 'plat'},
 {'nom_item': 'Plat n°47',
  'ingredients': ['pain', 'steak', 'salade', 's_ketchup', 'fromage'],
  'prix': 3.84,
  'type': 'plat'},
 {'nom_item': 'Plat n°48',
  'ingredients': ['pain', 'nugguet', 'salade', 's_barbecue', 'fromage'],
  'prix': 5.62,
  'type': 'plat'},
 {'nom_item': 'Plat n°49',
  'ingredients': ['pain', 'fish', 'tomate', 's_mayo', 'fromage'],
  'prix': 4.73,
  'type': 'plat'},
 {'nom_item': 'Plat n°50',
  'ingredients': ['pain', 'fish', 'tomate', 's_barbecue', 'fromage'],
  'prix': 4.73,
  'type': 'plat'},
 {'nom_item': 'Dessert n°1',
  'ingredients': ['banane', 'glace_pist', 's_choco', 'croustille'],
  'prix': 3.74,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°2',
  'ingredients': ['pomme', 'glace_van', 's_caramel', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°3',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°4',
  'ingredients': ['pomme', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°5',
  'ingredients': ['banane', 'glace_pist', 's_café', 'croustille'],
  'prix': 4.73,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°6',
  'ingredients': ['banane', 'glace_van', 's_café', 'croustille'],
  'prix': 3.83,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°7',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 1.95,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°8',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°9',
  'ingredients': ['banane', 'glace_pist', 's_café', 'croustille'],
  'prix': 3.74,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°10',
  'ingredients': ['orange', 'glace_pist', 's_café', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°11',
  'ingredients': ['orange', 'glace_choco', 's_café', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°12',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 1.95,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°13',
  'ingredients': ['banane', 'glace_pist', 's_café', 'croustille'],
  'prix': 2.75,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°14',
  'ingredients': ['orange', 'glace_pist', 's_choco', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°15',
  'ingredients': ['banane', 'glace_pist', 's_choco', 'croustille'],
  'prix': 4.73,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°16',
  'ingredients': ['pomme', 'glace_van', 's_choco', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°17',
  'ingredients': ['pomme', 'glace_choco', 's_choco', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°18',
  'ingredients': ['orange', 'glace_van', 's_café', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°19',
  'ingredients': ['pomme', 'glace_van', 's_choco', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°20',
  'ingredients': ['orange', 'glace_van', 's_caramel', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°21',
  'ingredients': ['pomme', 'glace_van', 's_café', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°22',
  'ingredients': ['banane', 'glace_pist', 's_café', 'croustille'],
  'prix': 2.75,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°23',
  'ingredients': ['orange', 'glace_van', 's_caramel', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°24',
  'ingredients': ['banane', 'glace_van', 's_café', 'croustille'],
  'prix': 2.45,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°25',
  'ingredients': ['orange', 'glace_choco', 's_café', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°26',
  'ingredients': ['pomme', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°27',
  'ingredients': ['banane', 'glace_choco', 's_choco', 'croustille'],
  'prix': 3.74,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°28',
  'ingredients': ['banane', 'glace_pist', 's_café', 'croustille'],
  'prix': 3.74,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°29',
  'ingredients': ['pomme', 'glace_choco', 's_choco', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°30',
  'ingredients': ['banane', 'glace_choco', 's_café', 'croustille'],
  'prix': 2.75,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°31',
  'ingredients': ['pomme', 'glace_choco', 's_café', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°32',
  'ingredients': ['orange', 'glace_choco', 's_café', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°33',
  'ingredients': ['pomme', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°34',
  'ingredients': ['orange', 'glace_van', 's_café', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°35',
  'ingredients': ['pomme', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°36',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°37',
  'ingredients': ['banane', 'glace_pist', 's_choco', 'croustille'],
  'prix': 3.74,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°38',
  'ingredients': ['pomme', 'glace_van', 's_choco', 'croustille'],
  'prix': 3.33,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°39',
  'ingredients': ['pomme', 'glace_pist', 's_choco', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°40',
  'ingredients': ['pomme', 'glace_pist', 's_café', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°41',
  'ingredients': ['orange', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°42',
  'ingredients': ['orange', 'glace_pist', 's_café', 'croustille'],
  'prix': 3.24,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°43',
  'ingredients': ['pomme', 'glace_choco', 's_café', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°44',
  'ingredients': ['banane', 'glace_pist', 's_caramel', 'croustille'],
  'prix': 2.75,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°45',
  'ingredients': ['orange', 'glace_pist', 's_choco', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°46',
  'ingredients': ['banane', 'glace_pist', 's_choco', 'croustille'],
  'prix': 2.75,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°47',
  'ingredients': ['pomme', 'glace_pist', 's_choco', 'croustille'],
  'prix': 4.23,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°48',
  'ingredients': ['orange', 'glace_van', 's_choco', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°49',
  'ingredients': ['orange', 'glace_van', 's_caramel', 'croustille'],
  'prix': 2.64,
  'type': 'dessert'},
 {'nom_item': 'Dessert n°50',
  'ingredients': ['orange', 'glace_choco', 's_caramel', 'croustille'],
  'prix': 2.25,
  'type': 'dessert'}]

In [25]:
df_boisson = pd.DataFrame({
    "nom_item": ["coca_p", "coca_zero_p", "fanta_orange_p", "fanta_citron_p", "sprite_p", "vittel_p", "san_pellegrino_p", "jus_orange_p", "jus_pomme_p", "heinneken_p", 
    "coca_zero_m", "fanta_orange_m", "fanta_citron_m", "sprite_m", "vittel_m", "san_pellegrino_m", "jus_orange_m", "jus_pomme_m", "heinneken_m",
    "coca_g", "coca_zero_g", "fanta_orange_g", "fanta_citron_g", "sprite_g", "vittel_g", "san_pellegrino_g", "jus_orange_g", "jus_pomme_g", "heinneken_g"
    ],
    "prix": [1.49, 0.99, 1.49, 1.49, 0.99, 0.99, 1.49, 1.99, 1.99, 2.99,
    0.99*1.25, 1.49*1.25, 1.49*1.25, 0.99*1.25, 0.99*1.25, 1.49*1.25, 1.99*1.25, 1.99*1.25, 2.99*1.25,
    1.49*1.5, 0.99*1.5, 1.49*1.5, 1.49*1.5, 0.99*1.5, 0.99*1.5, 1.49*1.5, 1.99*1.5, 1.99*1.5, 2.99*1.5
    ],
    "type" : "boisson"
    })

df_boisson["prix"] = round(df_boisson["prix"], 2)

df_boisson

            nom_item  prix     type
0             coca_p  1.49  boisson
1        coca_zero_p  0.99  boisson
2     fanta_orange_p  1.49  boisson
3     fanta_citron_p  1.49  boisson
4           sprite_p  0.99  boisson
5           vittel_p  0.99  boisson
6   san_pellegrino_p  1.49  boisson
7       jus_orange_p  1.99  boisson
8        jus_pomme_p  1.99  boisson
9        heinneken_p  2.99  boisson
10       coca_zero_m  1.24  boisson
11    fanta_orange_m  1.86  boisson
12    fanta_citron_m  1.86  boisson
13          sprite_m  1.24  boisson
14          vittel_m  1.24  boisson
15  san_pellegrino_m  1.86  boisson
16      jus_orange_m  2.49  boisson
17       jus_pomme_m  2.49  boisson
18       heinneken_m  3.74  boisson
19            coca_g  2.24  boisson
20       coca_zero_g  1.48  boisson
21    fanta_orange_g  2.24  boisson
22    fanta_citron_g  2.24  boisson
23          sprite_g  1.48  boisson
24          vittel_g  1.48  boisson
25  san_pellegrino_g  2.24  boisson
26      jus_orange_g  2.98  boisson
27       jus_pomme_g  2.98  boisson
28       heinneken_g  4.49  boisson

In [26]:
list_boisson = []

for boisson in df_boisson.nom_item:
    list_boisson.append(boisson)

list_boisson

['coca_p',
 'coca_zero_p',
 'fanta_orange_p',
 'fanta_citron_p',
 'sprite_p',
 'vittel_p',
 'san_pellegrino_p',
 'jus_orange_p',
 'jus_pomme_p',
 'heinneken_p',
 'coca_zero_m',
 'fanta_orange_m',
 'fanta_citron_m',
 'sprite_m',
 'vittel_m',
 'san_pellegrino_m',
 'jus_orange_m',
 'jus_pomme_m',
 'heinneken_m',
 'coca_g',
 'coca_zero_g',
 'fanta_orange_g',
 'fanta_citron_g',
 'sprite_g',
 'vittel_g',
 'san_pellegrino_g',
 'jus_orange_g',
 'jus_pomme_g',
 'heinneken_g']

In [27]:
len(df_ingredient)

21

In [28]:
list_stock = []
for i in range (len(df_ingredient)):
    list_stock.append(rd.randint(50,500))

list_stock

[156,
 433,
 229,
 337,
 262,
 297,
 237,
 422,
 358,
 286,
 89,
 415,
 194,
 132,
 275,
 400,
 478,
 151,
 439,
 324,
 389]

In [29]:
df_stock = df_ingredient.copy()
del df_stock['prix']

df_stock['code_postal'] = ''
df_stock['code_postal'] = df_stock['code_postal'].apply(lambda x : code_postal[rd.randint(0, len(code_postal)-1)])

df_stock['quantité'] = ''
df_stock['quantité'] = df_stock['quantité'].apply(lambda x : list_stock[rd.randint(0, len(list_stock)-1)])

df_stock

            code_postal  quantité
ingredient
pain             257126        89
steak             38978       389
nugguet       3373-5558       400
fish               0885       400
salade           788735       229
tomate             3348       229
cornichon          8546       132
s_mayo          L17 8DW       358
s_ketchup        552576       415
s_barbecue        96-15       262
fromage           12737       433
banane            42763       478
pomme             10114       297
orange           245267       297
glace_van       5799 NY        89
glace_choco       11111       275
glace_pist      7972 KG       286
s_choco           30907       337
s_caramel          7072        89
s_café             1617       286
croustille         8563       237

In [30]:
df_stock.quantité.sans = 0

In [31]:
df_stock

            code_postal  quantité
ingredient
pain             257126        89
steak             38978       389
nugguet       3373-5558       400
fish               0885       400
salade           788735       229
tomate             3348       229
cornichon          8546       132
s_mayo          L17 8DW       358
s_ketchup        552576       415
s_barbecue        96-15       262
fromage           12737       433
banane            42763       478
pomme             10114       297
orange           245267       297
glace_van       5799 NY        89
glace_choco       11111       275
glace_pist      7972 KG       286
s_choco           30907       337
s_caramel          7072        89
s_café             1617       286
croustille         8563       237

In [32]:
df_stock.quantité['pain']

89

In [33]:
df_recette = pd.DataFrame()


for recette in list_recette:
    # print(recette["name"])
    for ingredient in recette["ingredients"]:
        df = pd.DataFrame({
            "nom_item": [recette["nom_item"]], 
            "ingredient": [ingredient],
            "quantité": df_stock.quantité[ingredient]
            })
        df_recette = pd.concat([df_recette, df])

        # print(ingredient)
        # df_recette.append(df)

df_recette

        nom_item   ingredient  quantité
0       Plat n°1         pain        89
0       Plat n°1      nugguet       400
0       Plat n°1       salade       229
0       Plat n°1    s_ketchup       415
0       Plat n°1      fromage       433
..           ...          ...       ...
0   Dessert n°49   croustille       237
0   Dessert n°50       orange       297
0   Dessert n°50  glace_choco       275
0   Dessert n°50    s_caramel        89
0   Dessert n°50   croustille       237

[450 rows x 3 columns]

## ITEM

In [34]:
df_item = pd.DataFrame(list_recette)
del df_item["ingredients"]

df_item

        nom_item  prix     type
0       Plat n°1  4.84     plat
1       Plat n°2  5.83     plat
2       Plat n°3  4.34     plat
3       Plat n°4  3.65     plat
4       Plat n°5  3.75     plat
..           ...   ...      ...
95  Dessert n°46  2.75  dessert
96  Dessert n°47  4.23  dessert
97  Dessert n°48  2.64  dessert
98  Dessert n°49  2.64  dessert
99  Dessert n°50  2.25  dessert

[100 rows x 3 columns]

In [35]:
df_item = pd.concat([df_item, df_boisson])

df_item

            nom_item  prix     type
0           Plat n°1  4.84     plat
1           Plat n°2  5.83     plat
2           Plat n°3  4.34     plat
3           Plat n°4  3.65     plat
4           Plat n°5  3.75     plat
..               ...   ...      ...
24          vittel_g  1.48  boisson
25  san_pellegrino_g  2.24  boisson
26      jus_orange_g  2.98  boisson
27       jus_pomme_g  2.98  boisson
28       heinneken_g  4.49  boisson

[129 rows x 3 columns]

## CARTE ITEM

In [36]:
len(list_pays)

34

In [37]:
df_carte_item = df_item.copy()
carte_item = []

for pays in range(0,3):
    for item in df_carte_item.nom_item:
        # print(item)
        carte_item.append({
            "id_item": item,
            "pays": list_pays[rd.randint(0, len(list_pays))-1]
        })

In [38]:
list_item = []

for item in carte_item:
    change_item = [item['id_item'], item['pays']]
    list_item.append(change_item)


# print(list_item)

df_carte_item = pd.DataFrame(carte_item)

In [39]:
item_restant_list= list_item.copy()
selected_item_list= []


for pays in list_pays:
    for _ in range(80):
        for item in list_item:
            if item not in selected_item_list:
                if len(item_restant_list) > 0:
                    # print(item)
                    selected_item_list.append(item)
                    item_restant_list.remove(item)
                    #print(len(item_restant_list))

df_carte_item = pd.DataFrame(selected_item_list)

df_carte_item = df_carte_item.rename(columns={0:"id_item",1:"pays"})

df_carte_item = df_carte_item.sort_values("id_item")

df_carte_item

          id_item                pays
175   Dessert n°1         Philippines
50    Dessert n°1               Italy
301   Dessert n°1             Vietnam
184  Dessert n°10           Australia
59   Dessert n°10  Russian Federation
..            ...                 ...
114      vittel_m               Chile
239      vittel_m           Australia
352      vittel_p            Pakistan
230      vittel_p             Nigeria
105      vittel_p             Vietnam

[375 rows x 2 columns]

## MENU

Prix total des plats, boissons, desserts, moins 10%

In [40]:
df_plat = pd.DataFrame(list_plat)
df_dessert = pd.DataFrame(list_dessert)

In [41]:
list_plat = []

for plat in df_plat.nom_item:
    list_plat.append(plat)

#list_plat

In [42]:
list_dessert = []

for plat in df_dessert.nom_item:
    list_dessert.append(plat)

#list_dessert

In [43]:
del df_plat['ingredients']

df_plat.head(5)

   nom_item  prix  type
0  Plat n°1  4.84  plat
1  Plat n°2  5.83  plat
2  Plat n°3  4.34  plat
3  Plat n°4  3.65  plat
4  Plat n°5  3.75  plat

In [44]:
del df_dessert['ingredients']

df_dessert.head(5)

      nom_item  prix     type
0  Dessert n°1  3.74  dessert
1  Dessert n°2  2.64  dessert
2  Dessert n°3  3.33  dessert
3  Dessert n°4  2.25  dessert
4  Dessert n°5  4.73  dessert

In [45]:
menu1 = []
menu2 = []
menu3 = []
menu4 = []
menu5 = []
menu6 = []
menu7 = []
menu8 = []
menu9 = []
menu10 = []

list_menu = [menu1, menu2, menu3, menu4, menu5, menu6, menu7, menu8, menu9, menu10]

for menu in list_menu:
    menu.append(list_plat[rd.randint(0,len(list_plat)-1)])
    menu.append(list_boisson[rd.randint(0,len(list_boisson)-1)])
    menu.append(list_dessert[rd.randint(0,len(list_dessert)-1)])

list_menu

[['Plat n°9', 'coca_p', 'Dessert n°11'],
 ['Plat n°38', 'jus_orange_g', 'Dessert n°29'],
 ['Plat n°28', 'sprite_m', 'Dessert n°10'],
 ['Plat n°49', 'fanta_orange_p', 'Dessert n°28'],
 ['Plat n°29', 'heinneken_g', 'Dessert n°23'],
 ['Plat n°31', 'heinneken_p', 'Dessert n°10'],
 ['Plat n°2', 'san_pellegrino_p', 'Dessert n°19'],
 ['Plat n°13', 'fanta_citron_p', 'Dessert n°19'],
 ['Plat n°39', 'coca_zero_g', 'Dessert n°2'],
 ['Plat n°40', 'coca_zero_p', 'Dessert n°16']]

In [46]:
df_menu_item_prix = df_item.set_index("nom_item")

df_menu_item_prix.head(5)

          prix  type
nom_item
Plat n°1  4.84  plat
Plat n°2  5.83  plat
Plat n°3  4.34  plat
Plat n°4  3.65  plat
Plat n°5  3.75  plat

In [47]:
df_menu = pd.DataFrame(list_menu)

df_menu = df_menu.rename(columns={0:"plat",1:"boisson",2:"dessert"})

df_menu['id_menu'] = df_menu.index

df_menu["prix"] = 0

df_menu

        plat           boisson       dessert  id_menu  prix
0   Plat n°9            coca_p  Dessert n°11        0     0
1  Plat n°38      jus_orange_g  Dessert n°29        1     0
2  Plat n°28          sprite_m  Dessert n°10        2     0
3  Plat n°49    fanta_orange_p  Dessert n°28        3     0
4  Plat n°29       heinneken_g  Dessert n°23        4     0
5  Plat n°31       heinneken_p  Dessert n°10        5     0
6   Plat n°2  san_pellegrino_p  Dessert n°19        6     0
7  Plat n°13    fanta_citron_p  Dessert n°19        7     0
8  Plat n°39       coca_zero_g   Dessert n°2        8     0
9  Plat n°40       coca_zero_p  Dessert n°16        9     0

In [48]:
def list_prix_fonc (list = list):
    prix = 0
    for i in range(len(list)):
        prix = prix + list[i]
    return prix * 0.9

In [49]:
po = [1,2,3]

list_prix_fonc(po)

5.4

In [50]:
list_prix = []

for menu in list_menu:
    list_prix.append(round(list_prix_fonc(df_menu_item_prix.prix[menu]),2))

list_prix

[10.75, 7.81, 9.45, 8.96, 10.58, 11.2, 9.59, 9.04, 8.78, 7.61]

In [51]:
df_menu["prix"] = list_prix

df_menu

        plat           boisson       dessert  id_menu   prix
0   Plat n°9            coca_p  Dessert n°11        0  10.75
1  Plat n°38      jus_orange_g  Dessert n°29        1   7.81
2  Plat n°28          sprite_m  Dessert n°10        2   9.45
3  Plat n°49    fanta_orange_p  Dessert n°28        3   8.96
4  Plat n°29       heinneken_g  Dessert n°23        4  10.58
5  Plat n°31       heinneken_p  Dessert n°10        5  11.20
6   Plat n°2  san_pellegrino_p  Dessert n°19        6   9.59
7  Plat n°13    fanta_citron_p  Dessert n°19        7   9.04
8  Plat n°39       coca_zero_g   Dessert n°2        8   8.78
9  Plat n°40       coca_zero_p  Dessert n°16        9   7.61

## CARTE MENU

In [52]:
list_carte_menu = []

for pays in list_pays:   
    for menu in df_menu.id_menu:
      list_carte_menu.append({
        "pays":pays,
        "id_menu":menu
      })

df_carte_menu = pd.DataFrame(list_carte_menu)

df_carte_menu

                   pays  id_menu
0         United States        0
1         United States        1
2         United States        2
3         United States        3
4         United States        4
..                  ...      ...
335  Russian Federation        5
336  Russian Federation        6
337  Russian Federation        7
338  Russian Federation        8
339  Russian Federation        9

[340 rows x 2 columns]

## Convert to SQL

In [53]:
df_resto

,code_postal,pays,capacite,espace_enfant,service_rapide,parking,accessibilite
0,24-13,United States,247,0,0,0,1
1,G27 7HT,South Africa,96,1,1,0,0
2,7443 YD,Colombia,68,1,0,1,1
3,93956-418,Vietnam,181,0,0,1,1
4,977145,Italy,75,0,0,0,0
...,...,...,...,...,...,...,...
245,183227,Turkey,126,0,1,1,0
246,8563,Germany,135,1,1,1,1
247,21354,Italy,63,0,0,0,0
248,4460,Pakistan,135,1,0,1,1
249,7363,Peru,198,1,1,1,1

In [54]:
df_resto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   code_postal     250 non-null    object
 1   pays            250 non-null    object
 2   capacite        250 non-null    int64
 3   espace_enfant   250 non-null    int64
 4   service_rapide  250 non-null    int64
 5   parking         250 non-null    int64
 6   accessibilite   250 non-null    int64
dtypes: int64(5), object(2)
memory usage: 13.8+ KB

In [55]:
df_resto.to_sql(name='Restaurant', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:53,745 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Restaurant")
2022-12-13 16:43:53,747 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:53,749 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:53,754 INFO sqlalchemy.engine.Engine INSERT INTO "Restaurant" (code_postal, pays, capacite, espace_enfant, service_rapide, parking, accessibilite) VALUES (?, ?, ?, ?, ?, ?, ?)
2022-12-13 16:43:53,755 INFO sqlalchemy.engine.Engine [generated in 0.00274s] (('24-13', 'United States', 247, 0, 0, 0, 1), ('G27 7HT', 'South Africa', 96, 1, 1, 0, 0), ('7443 YD', 'Colombia', 68, 1, 0, 1, 1), ('93956-418', 'Vietnam', 181, 0, 0, 1, 1), ('977145', 'Italy', 75, 0, 0, 0, 0), ('29552', 'Ireland', 134, 1, 1, 1, 1), ('45331', 'China', 82, 1, 0, 1, 0), ('18345', 'France', 128, 1, 0, 0, 1)  ... displaying 10 of 250 total bound parameter sets ...  ('4460', 'Pakistan', 135, 1, 0, 1, 1), ('7363', 'Peru', 198, 1, 1, 1, 1))
2022-12-13 16:43:53,758 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:53,764 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:53,765 INFO sqlalchemy.engine.Engine [raw sql] ()

250

In [56]:
df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318
...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479

In [57]:
df_employes.to_sql(name='Employee', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:53,929 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Employee")
2022-12-13 16:43:53,930 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:53,935 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:53,952 INFO sqlalchemy.engine.Engine INSERT INTO "Employee" (nom, adresse, experience, poste, note, id_employee, code_postal) VALUES (?, ?, ?, ?, ?, ?, ?)
2022-12-13 16:43:53,953 INFO sqlalchemy.engine.Engine [generated in 0.01306s] (('Kenneth Snow', 'Ap #109-9179 Quisque Rd.', '4/5/2004', 'cuisinier', 0.0, 0, '43042'), ('Maia Garcia', '606 Odio. Ave', '3/5/2010', 'cuisinier', 1.0, 1, '164486'), ('Shannon Mooney', 'Ap #985-7190 Vulputate, Road', '7/9/2020', 'cuisinier', 3.0, 2, '776532'), ('Tatyana Pace', 'Ap #344-5490 Pellentesque Avenue', '26/11/2007', 'cuisinier', 0.0, 3, '37815'), ('Indira Vega', '152-5825 Urna Rd.', '16/4/2006', 'cuisinier', 9.0, 4, '9318'), ('Quinn Murphy', '133 Sit St.', '2/2/2001', 'cuisinier', 5.0, 5, '183227'), ('Montana Craig', '5356 Auctor. Rd.', '26/9/2016', 'cuisinier', 4.0, 6, '221896'), ('Sonya Reeves', 'P.O. Box 552, 214 Feugiat St.', '21/4/2018', 'cuisinier', 1.0, 7, '8481 KH')  ... displaying 10 of 3645 total bound parameter sets ...  ('Charity Humphrey', 'Ap #234-705 Faucibus Av.', '20/12/2008', 'cuisinier', 2.0, 3643, '282669'), ('Wanda Sullivan', 'P.O. Box 959, 5947 Volutpat. Av.', '31/5/2019', 'cuisinier', 7.0, 3644, '6479'))
2022-12-13 16:43:53,959 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:53,964 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:53,965 INFO sqlalchemy.engine.Engine [raw sql] ()

3645

In [58]:
df_pays

                  pays
0        United States
1         South Africa
2             Colombia
3              Vietnam
4                Italy
5              Ireland
6                China
7               France
8                 Peru
9          New Zealand
10               Spain
11              Brazil
12           Australia
13             Austria
14            Pakistan
15              Poland
16              Canada
17          Costa Rica
18              Mexico
19         Philippines
20           Indonesia
21             Ukraine
22              Turkey
23           Singapore
24             Nigeria
25               Chile
26              Norway
27         South Korea
28      United Kingdom
29         Netherlands
30               India
31             Belgium
32             Germany
33  Russian Federation

In [59]:
df_pays.to_sql(name='Pays', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,099 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Pays")
2022-12-13 16:43:54,100 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,103 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,104 INFO sqlalchemy.engine.Engine INSERT INTO "Pays" (pays) VALUES (?)
2022-12-13 16:43:54,105 INFO sqlalchemy.engine.Engine [generated in 0.00117s] (('United States',), ('South Africa',), ('Colombia',), ('Vietnam',), ('Italy',), ('Ireland',), ('China',), ('France',)  ... displaying 10 of 34 total bound parameter sets ...  ('Germany',), ('Russian Federation',))
2022-12-13 16:43:54,107 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,112 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,113 INFO sqlalchemy.engine.Engine [raw sql] ()

34

In [60]:
df_ingredient = df_ingredient.reset_index()

df_ingredient

     ingredient  prix
0          pain  0.49
1         steak  0.99
2       nugguet  1.19
3          fish  1.49
4        salade  0.29
5        tomate  0.29
6     cornichon  0.09
7        s_mayo  0.19
8     s_ketchup  0.19
9    s_barbecue  0.19
10      fromage  0.39
11       banane  0.99
12        pomme  0.49
13       orange  0.49
14    glace_van  0.69
15  glace_choco  0.99
16   glace_pist  0.99
17      s_choco  0.19
18    s_caramel  0.19
19       s_café  0.19
20   croustille  0.09

In [61]:
df_ingredient.to_sql(name='Ingredient', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,277 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Ingredient")
2022-12-13 16:43:54,278 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,280 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,282 INFO sqlalchemy.engine.Engine INSERT INTO "Ingredient" (ingredient, prix) VALUES (?, ?)
2022-12-13 16:43:54,282 INFO sqlalchemy.engine.Engine [generated in 0.00090s] (('pain', 0.49), ('steak', 0.99), ('nugguet', 1.19), ('fish', 1.49), ('salade', 0.29), ('tomate', 0.29), ('cornichon', 0.09), ('s_mayo', 0.19)  ... displaying 10 of 21 total bound parameter sets ...  ('s_café', 0.19), ('croustille', 0.09))
2022-12-13 16:43:54,284 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,289 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,290 INFO sqlalchemy.engine.Engine [raw sql] ()

21

In [62]:
df_item

            nom_item  prix     type
0           Plat n°1  4.84     plat
1           Plat n°2  5.83     plat
2           Plat n°3  4.34     plat
3           Plat n°4  3.65     plat
4           Plat n°5  3.75     plat
..               ...   ...      ...
24          vittel_g  1.48  boisson
25  san_pellegrino_g  2.24  boisson
26      jus_orange_g  2.98  boisson
27       jus_pomme_g  2.98  boisson
28       heinneken_g  4.49  boisson

[129 rows x 3 columns]

In [63]:
df_item.to_sql(name='Item', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,455 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Item")
2022-12-13 16:43:54,456 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,459 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,460 INFO sqlalchemy.engine.Engine INSERT INTO "Item" (nom_item, prix, type) VALUES (?, ?, ?)
2022-12-13 16:43:54,461 INFO sqlalchemy.engine.Engine [generated in 0.00117s] (('Plat n°1', 4.84, 'plat'), ('Plat n°2', 5.83, 'plat'), ('Plat n°3', 4.34, 'plat'), ('Plat n°4', 3.65, 'plat'), ('Plat n°5', 3.75, 'plat'), ('Plat n°6', 4.62, 'plat'), ('Plat n°7', 6.02, 'plat'), ('Plat n°8', 4.34, 'plat')  ... displaying 10 of 129 total bound parameter sets ...  ('jus_pomme_g', 2.98, 'boisson'), ('heinneken_g', 4.49, 'boisson'))
2022-12-13 16:43:54,464 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,469 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,470 INFO sqlalchemy.engine.Engine [raw sql] ()

129

In [64]:
df_stock = df_stock.reset_index()

df_stock.sort_values(by="code_postal")

     ingredient code_postal  quantité
3          fish        0885       400
12        pomme       10114       297
15  glace_choco       11111       275
10      fromage       12737       433
19       s_café        1617       286
13       orange      245267       297
0          pain      257126        89
17      s_choco       30907       337
5        tomate        3348       229
2       nugguet   3373-5558       400
1         steak       38978       389
11       banane       42763       478
8     s_ketchup      552576       415
14    glace_van     5799 NY        89
18    s_caramel        7072        89
4        salade      788735       229
16   glace_pist     7972 KG       286
6     cornichon        8546       132
20   croustille        8563       237
9    s_barbecue       96-15       262
7        s_mayo     L17 8DW       358

In [65]:
df_stock.to_sql(name='Stock', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,631 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Stock")
2022-12-13 16:43:54,632 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,634 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,636 INFO sqlalchemy.engine.Engine INSERT INTO "Stock" (ingredient, code_postal, "quantité") VALUES (?, ?, ?)
2022-12-13 16:43:54,637 INFO sqlalchemy.engine.Engine [generated in 0.00122s] (('pain', '257126', 89), ('steak', '38978', 389), ('nugguet', '3373-5558', 400), ('fish', '0885', 400), ('salade', '788735', 229), ('tomate', '3348', 229), ('cornichon', '8546', 132), ('s_mayo', 'L17 8DW', 358)  ... displaying 10 of 21 total bound parameter sets ...  ('s_café', '1617', 286), ('croustille', '8563', 237))
2022-12-13 16:43:54,639 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,643 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,644 INFO sqlalchemy.engine.Engine [raw sql] ()

21

In [66]:
df_recette

        nom_item   ingredient  quantité
0       Plat n°1         pain        89
0       Plat n°1      nugguet       400
0       Plat n°1       salade       229
0       Plat n°1    s_ketchup       415
0       Plat n°1      fromage       433
..           ...          ...       ...
0   Dessert n°49   croustille       237
0   Dessert n°50       orange       297
0   Dessert n°50  glace_choco       275
0   Dessert n°50    s_caramel        89
0   Dessert n°50   croustille       237

[450 rows x 3 columns]

In [67]:
df_recette.to_sql(name='Recette', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,813 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Recette")
2022-12-13 16:43:54,815 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,817 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,821 INFO sqlalchemy.engine.Engine INSERT INTO "Recette" (nom_item, ingredient, "quantité") VALUES (?, ?, ?)
2022-12-13 16:43:54,822 INFO sqlalchemy.engine.Engine [generated in 0.00342s] (('Plat n°1', 'pain', 89), ('Plat n°1', 'nugguet', 400), ('Plat n°1', 'salade', 229), ('Plat n°1', 's_ketchup', 415), ('Plat n°1', 'fromage', 433), ('Plat n°2', 'pain', 89), ('Plat n°2', 'fish', 400), ('Plat n°2', 'salade', 229)  ... displaying 10 of 450 total bound parameter sets ...  ('Dessert n°50', 's_caramel', 89), ('Dessert n°50', 'croustille', 237))
2022-12-13 16:43:54,825 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,830 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,830 INFO sqlalchemy.engine.Engine [raw sql] ()

450

In [68]:
df_carte_item

          id_item                pays
175   Dessert n°1         Philippines
50    Dessert n°1               Italy
301   Dessert n°1             Vietnam
184  Dessert n°10           Australia
59   Dessert n°10  Russian Federation
..            ...                 ...
114      vittel_m               Chile
239      vittel_m           Australia
352      vittel_p            Pakistan
230      vittel_p             Nigeria
105      vittel_p             Vietnam

[375 rows x 2 columns]

In [69]:
df_carte_item.to_sql(name='CarteItem', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:54,983 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("CarteItem")
2022-12-13 16:43:54,985 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:54,987 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:54,990 INFO sqlalchemy.engine.Engine INSERT INTO "CarteItem" (id_item, pays) VALUES (?, ?)
2022-12-13 16:43:54,990 INFO sqlalchemy.engine.Engine [generated in 0.00131s] (('Dessert n°1', 'Philippines'), ('Dessert n°1', 'Italy'), ('Dessert n°1', 'Vietnam'), ('Dessert n°10', 'Australia'), ('Dessert n°10', 'Russian Federation'), ('Dessert n°10', 'Ukraine'), ('Dessert n°11', 'Pakistan'), ('Dessert n°11', 'Singapore')  ... displaying 10 of 375 total bound parameter sets ...  ('vittel_p', 'Nigeria'), ('vittel_p', 'Vietnam'))
2022-12-13 16:43:54,992 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:54,998 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:54,998 INFO sqlalchemy.engine.Engine [raw sql] ()

375

In [70]:
df_menu

        plat           boisson       dessert  id_menu   prix
0   Plat n°9            coca_p  Dessert n°11        0  10.75
1  Plat n°38      jus_orange_g  Dessert n°29        1   7.81
2  Plat n°28          sprite_m  Dessert n°10        2   9.45
3  Plat n°49    fanta_orange_p  Dessert n°28        3   8.96
4  Plat n°29       heinneken_g  Dessert n°23        4  10.58
5  Plat n°31       heinneken_p  Dessert n°10        5  11.20
6   Plat n°2  san_pellegrino_p  Dessert n°19        6   9.59
7  Plat n°13    fanta_citron_p  Dessert n°19        7   9.04
8  Plat n°39       coca_zero_g   Dessert n°2        8   8.78
9  Plat n°40       coca_zero_p  Dessert n°16        9   7.61

In [71]:
df_menu.to_sql(name='Menu', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:55,152 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Menu")
2022-12-13 16:43:55,153 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:55,156 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:55,158 INFO sqlalchemy.engine.Engine INSERT INTO "Menu" (plat, boisson, dessert, id_menu, prix) VALUES (?, ?, ?, ?, ?)
2022-12-13 16:43:55,159 INFO sqlalchemy.engine.Engine [generated in 0.00108s] (('Plat n°9', 'coca_p', 'Dessert n°11', 0, 10.75), ('Plat n°38', 'jus_orange_g', 'Dessert n°29', 1, 7.81), ('Plat n°28', 'sprite_m', 'Dessert n°10', 2, 9.45), ('Plat n°49', 'fanta_orange_p', 'Dessert n°28', 3, 8.96), ('Plat n°29', 'heinneken_g', 'Dessert n°23', 4, 10.58), ('Plat n°31', 'heinneken_p', 'Dessert n°10', 5, 11.2), ('Plat n°2', 'san_pellegrino_p', 'Dessert n°19', 6, 9.59), ('Plat n°13', 'fanta_citron_p', 'Dessert n°19', 7, 9.04), ('Plat n°39', 'coca_zero_g', 'Dessert n°2', 8, 8.78), ('Plat n°40', 'coca_zero_p', 'Dessert n°16', 9, 7.61))
2022-12-13 16:43:55,160 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:55,164 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:55,165 INFO sqlalchemy.engine.Engine [raw sql] ()

10

In [72]:
df_carte_menu

                   pays  id_menu
0         United States        0
1         United States        1
2         United States        2
3         United States        3
4         United States        4
..                  ...      ...
335  Russian Federation        5
336  Russian Federation        6
337  Russian Federation        7
338  Russian Federation        8
339  Russian Federation        9

[340 rows x 2 columns]

In [73]:
df_carte_menu.to_sql(name='CarteMenu', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:55,293 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("CarteMenu")
2022-12-13 16:43:55,294 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:55,296 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:55,298 INFO sqlalchemy.engine.Engine INSERT INTO "CarteMenu" (pays, id_menu) VALUES (?, ?)
2022-12-13 16:43:55,299 INFO sqlalchemy.engine.Engine [generated in 0.00146s] (('United States', 0), ('United States', 1), ('United States', 2), ('United States', 3), ('United States', 4), ('United States', 5), ('United States', 6), ('United States', 7)  ... displaying 10 of 340 total bound parameter sets ...  ('Russian Federation', 8), ('Russian Federation', 9))
2022-12-13 16:43:55,301 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:55,307 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:55,307 INFO sqlalchemy.engine.Engine [raw sql] ()

340

## RIB

In [74]:
df_employes_rib = pd.io.sql.read_sql("select resto.pays, resto.code_postal as code_postal, employe.nom, employe.adresse, employe.id_employee from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal", con=engine)

df_employes_rib = df_employes_rib.sort_values("id_employee")

df_employes_rib

2022-12-13 16:43:55,376 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("select resto.pays, resto.code_postal as code_postal, employe.nom, employe.adresse, employe.id_employee from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal")
2022-12-13 16:43:55,377 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:55,378 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("select resto.pays, resto.code_postal as code_postal, employe.nom, employe.adresse, employe.id_employee from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal")
2022-12-13 16:43:55,379 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:55,381 INFO sqlalchemy.engine.Engine select resto.pays, resto.code_postal as code_postal, employe.nom, employe.adresse, employe.id_employee from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal
2022-12-13 16:43:55,382 INFO sqlalchemy.engine.Engine [raw sql] ()

,pays,code_postal,nom,adresse,id_employee
164,Philippines,43042,Kenneth Snow,Ap #109-9179 Quisque Rd.,0
200,Spain,164486,Maia Garcia,606 Odio. Ave,1
117,Netherlands,776532,Shannon Mooney,"Ap #985-7190 Vulputate, Road",2
155,Peru,37815,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,3
11,Austria,9318,Indira Vega,152-5825 Urna Rd.,4
...,...,...,...,...,...
184,Singapore,25655,Leah David,"P.O. Box 939, 5080 Nisi. Avenue",852
165,Philippines,50263,Quon Thompson,"P.O. Box 314, 1237 Turpis Rd.",859
175,Poland,3373-5558,Cody Charles,5516 Nunc Ave,901
18,Belgium,7072,Lael Dudley,"Ap #974-1005 Ut, Road",949
231,United States,3685 KV,Tyrone Malone,7578 Et Street,1356

In [75]:
def rib_pays (list = list):
    rib_FR = list[:2].upper()
    return rib_FR

rib_pays("Italy")

'IT'

In [76]:
for _ in range(5):
    print(fake.iban())

GB68NSYH96422458920221
GB20WQNH37504893326735
GB46HPMW09719806515702
GB22DXMX53762911252890
GB02CMYZ94403351982657

In [77]:
df_employes_rib['iban'] = df_employes_rib['pays'].apply (lambda x : str(rib_pays(x)) + str(rd.randint(0,9)) + str(rd.randint(0,9)) + str(fake.bban()))

df_employes_rib['bic'] = 'bic'
df_employes_rib['bic'] = df_employes_rib['bic'].apply (lambda x : str(fake.swift()))

df_employes_rib

,pays,code_postal,nom,adresse,id_employee,iban,bic
164,Philippines,43042,Kenneth Snow,Ap #109-9179 Quisque Rd.,0,PH27KJQN78764794865712,AEVVGB8K
200,Spain,164486,Maia Garcia,606 Odio. Ave,1,SP52CVSS09623975217907,UASUGBD4
117,Netherlands,776532,Shannon Mooney,"Ap #985-7190 Vulputate, Road",2,NE84HTPN99906636992273,TDYLGBZ8DJX
155,Peru,37815,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,3,PE77IPNX07813274596978,AZVVGBLB
11,Austria,9318,Indira Vega,152-5825 Urna Rd.,4,AU46ICYE69051835575794,FXFOGBO7BJJ
...,...,...,...,...,...,...,...
184,Singapore,25655,Leah David,"P.O. Box 939, 5080 Nisi. Avenue",852,SI63HEDM19315827407647,KNUSGBSI
165,Philippines,50263,Quon Thompson,"P.O. Box 314, 1237 Turpis Rd.",859,PH48NLCD81164930457698,ISFCGBAG00V
175,Poland,3373-5558,Cody Charles,5516 Nunc Ave,901,PO65MYTV19812894413937,FCEEGBMB
18,Belgium,7072,Lael Dudley,"Ap #974-1005 Ut, Road",949,BE85YYXU82045286788276,KJHEGB8E
231,United States,3685 KV,Tyrone Malone,7578 Et Street,1356,UN55GKNW76672982365790,IOTPGBH26S0

In [78]:
del df_employes_rib['pays']
del df_employes_rib['code_postal']

df_employes_rib

,nom,adresse,id_employee,iban,bic
164,Kenneth Snow,Ap #109-9179 Quisque Rd.,0,PH27KJQN78764794865712,AEVVGB8K
200,Maia Garcia,606 Odio. Ave,1,SP52CVSS09623975217907,UASUGBD4
117,Shannon Mooney,"Ap #985-7190 Vulputate, Road",2,NE84HTPN99906636992273,TDYLGBZ8DJX
155,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,3,PE77IPNX07813274596978,AZVVGBLB
11,Indira Vega,152-5825 Urna Rd.,4,AU46ICYE69051835575794,FXFOGBO7BJJ
...,...,...,...,...,...
184,Leah David,"P.O. Box 939, 5080 Nisi. Avenue",852,SI63HEDM19315827407647,KNUSGBSI
165,Quon Thompson,"P.O. Box 314, 1237 Turpis Rd.",859,PH48NLCD81164930457698,ISFCGBAG00V
175,Cody Charles,5516 Nunc Ave,901,PO65MYTV19812894413937,FCEEGBMB
18,Lael Dudley,"Ap #974-1005 Ut, Road",949,BE85YYXU82045286788276,KJHEGB8E
231,Tyrone Malone,7578 Et Street,1356,UN55GKNW76672982365790,IOTPGBH26S0

In [79]:
df_employes_rib = df_employes_rib.rename(columns={"nom":"propriètaire"})

df_employes_rib

,propriètaire,adresse,id_employee,iban,bic
164,Kenneth Snow,Ap #109-9179 Quisque Rd.,0,PH27KJQN78764794865712,AEVVGB8K
200,Maia Garcia,606 Odio. Ave,1,SP52CVSS09623975217907,UASUGBD4
117,Shannon Mooney,"Ap #985-7190 Vulputate, Road",2,NE84HTPN99906636992273,TDYLGBZ8DJX
155,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,3,PE77IPNX07813274596978,AZVVGBLB
11,Indira Vega,152-5825 Urna Rd.,4,AU46ICYE69051835575794,FXFOGBO7BJJ
...,...,...,...,...,...
184,Leah David,"P.O. Box 939, 5080 Nisi. Avenue",852,SI63HEDM19315827407647,KNUSGBSI
165,Quon Thompson,"P.O. Box 314, 1237 Turpis Rd.",859,PH48NLCD81164930457698,ISFCGBAG00V
175,Cody Charles,5516 Nunc Ave,901,PO65MYTV19812894413937,FCEEGBMB
18,Lael Dudley,"Ap #974-1005 Ut, Road",949,BE85YYXU82045286788276,KJHEGB8E
231,Tyrone Malone,7578 Et Street,1356,UN55GKNW76672982365790,IOTPGBH26S0

In [80]:
df_employes_rib.to_sql(name='Rib', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:55,876 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Rib")
2022-12-13 16:43:55,876 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:55,879 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:55,883 INFO sqlalchemy.engine.Engine INSERT INTO "Rib" ("propriètaire", adresse, id_employee, iban, bic) VALUES (?, ?, ?, ?, ?)
2022-12-13 16:43:55,883 INFO sqlalchemy.engine.Engine [generated in 0.00210s] (('Kenneth Snow', 'Ap #109-9179 Quisque Rd.', 0, 'PH27KJQN78764794865712', 'AEVVGB8K'), ('Maia Garcia', '606 Odio. Ave', 1, 'SP52CVSS09623975217907', 'UASUGBD4'), ('Shannon Mooney', 'Ap #985-7190 Vulputate, Road', 2, 'NE84HTPN99906636992273', 'TDYLGBZ8DJX'), ('Tatyana Pace', 'Ap #344-5490 Pellentesque Avenue', 3, 'PE77IPNX07813274596978', 'AZVVGBLB'), ('Indira Vega', '152-5825 Urna Rd.', 4, 'AU46ICYE69051835575794', 'FXFOGBO7BJJ'), ('Quinn Murphy', '133 Sit St.', 5, 'TU35AEZB04108312298393', 'OBMVGBX0'), ('Montana Craig', '5356 Auctor. Rd.', 6, 'CO71SJQF41336088123642', 'GRHZGBL6'), ('Sonya Reeves', 'P.O. Box 552, 214 Feugiat St.', 7, 'NE40IEMB54017480059726', 'TSEKGBBSY31')  ... displaying 10 of 250 total bound parameter sets ...  ('Lael Dudley', 'Ap #974-1005 Ut, Road', 949, 'BE85YYXU82045286788276', 'KJHEGB8E'), ('Tyrone Malone', '7578 Et Street', 1356, 'UN55GKNW76672982365790', 'IOTPGBH26S0'))
2022-12-13 16:43:55,885 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:55,891 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:55,892 INFO sqlalchemy.engine.Engine [raw sql] ()

250

## FICHES DE PAIE

In [81]:
df_employes_copy = df_employes.copy()
df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318
...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479

In [82]:
df_employes['salaire_net'] = 0

df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042,0
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486,0
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532,0
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815,0
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318,0
...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486,0
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725,0
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537,0
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669,0
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479,0

In [83]:
def salaire_base(poste):
    if poste == 'cuisinier':
        return 1600
    if poste == 'caissier':
        return 1500
    if poste == 'manager':
        return 1800
    if poste == 'directeur':
        return 3000

df_employes['salaire_net'] = df_employes['poste'].apply(lambda x:salaire_base(x))

df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042,1600
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486,1600
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532,1600
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815,1600
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318,1600
...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486,1600
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725,1600
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537,1600
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669,1600
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479,1600

In [84]:
df_employes['salaire_net'].value_counts()

1600    2000
1500    1000
1800     400
3000     245
Name: salaire_net, dtype: int64

In [85]:
current_date = round(dt.datetime.today().timestamp())

print(current_date)

1670946236

In [86]:
print(df_employes.experience[0])

4/5/2004

In [87]:
print(round(dt.datetime.strptime(df_employes.experience[0], "%d/%m/%Y").timestamp()))

1083621600

In [88]:
print(current_date - round(dt.datetime.strptime(df_employes.experience[0], "%d/%m/%Y").timestamp()))

587324636

In [89]:
df_employes["date_entrée"] = df_employes["experience"]

df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net,date_entrée
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042,1600,4/5/2004
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486,1600,3/5/2010
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532,1600,7/9/2020
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815,1600,26/11/2007
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318,1600,16/4/2006
...,...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486,1600,10/8/2017
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725,1600,11/11/2015
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537,1600,4/9/2007
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669,1600,20/12/2008
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479,1600,31/5/2019

In [90]:
df_employes["experience"] = df_employes["experience"].apply(lambda x : "formation" if current_date - round(dt.datetime.strptime(x, "%d/%m/%Y").timestamp()) < 31556952 else "expérimenté")

df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net,date_entrée
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,expérimenté,cuisinier,0.0,0,43042,1600,4/5/2004
1,Maia Garcia,606 Odio. Ave,expérimenté,cuisinier,1.0,1,164486,1600,3/5/2010
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",expérimenté,cuisinier,3.0,2,776532,1600,7/9/2020
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,expérimenté,cuisinier,0.0,3,37815,1600,26/11/2007
4,Indira Vega,152-5825 Urna Rd.,expérimenté,cuisinier,9.0,4,9318,1600,16/4/2006
...,...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,expérimenté,cuisinier,6.0,3640,164486,1600,10/8/2017
3641,Cally Burton,290-9064 Sed Rd.,expérimenté,cuisinier,5.0,3641,3725,1600,11/11/2015
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,expérimenté,cuisinier,5.0,3642,327537,1600,4/9/2007
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,expérimenté,cuisinier,2.0,3643,282669,1600,20/12/2008
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",expérimenté,cuisinier,7.0,3644,6479,1600,31/5/2019

In [91]:
df_employes["experience"].value_counts()

expérimenté    3350
formation       295
Name: experience, dtype: int64

In [92]:
df_employes["experience"][0]

'expérimenté'

In [93]:
for employe in range(len(df_employes)):

    if df_employes["experience"][employe] == 'formation':
        df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 0.8, 2)

    if df_employes["note"][employe] == 10:
        df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.3, 2)

    elif df_employes["note"][employe] > 8:
        df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.1, 2)

    elif df_employes["note"][employe] > 5:
        df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.05, 2)

df_employes

/tmp/ipykernel_66828/60570199.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.1, 2)
/tmp/ipykernel_66828/60570199.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.05, 2)
/tmp/ipykernel_66828/60570199.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 0.8, 2)
/tmp/ipykernel_66828/60570199.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_employes["salaire_net"][employe] = round(df_employes["salaire_net"][employe] * 1.3, 2)

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net,date_entrée
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,expérimenté,cuisinier,0.0,0,43042,1600,4/5/2004
1,Maia Garcia,606 Odio. Ave,expérimenté,cuisinier,1.0,1,164486,1600,3/5/2010
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",expérimenté,cuisinier,3.0,2,776532,1600,7/9/2020
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,expérimenté,cuisinier,0.0,3,37815,1600,26/11/2007
4,Indira Vega,152-5825 Urna Rd.,expérimenté,cuisinier,9.0,4,9318,1760,16/4/2006
...,...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,expérimenté,cuisinier,6.0,3640,164486,1680,10/8/2017
3641,Cally Burton,290-9064 Sed Rd.,expérimenté,cuisinier,5.0,3641,3725,1600,11/11/2015
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,expérimenté,cuisinier,5.0,3642,327537,1600,4/9/2007
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,expérimenté,cuisinier,2.0,3643,282669,1600,20/12/2008
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",expérimenté,cuisinier,7.0,3644,6479,1680,31/5/2019

In [94]:
df_employes["salaire_net"].value_counts()

1600    1008
1500     506
1680     491
1800     373
1575     281
3000     225
1760     223
1280     101
2080      98
1650      88
1950      57
1344      52
1200      36
1440      27
1260      22
2400      20
1408      19
1664       8
1320       6
1560       4
Name: salaire_net, dtype: int64

In [95]:
df_employes

,nom,adresse,experience,poste,note,id_employee,code_postal,salaire_net,date_entrée
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,expérimenté,cuisinier,0.0,0,43042,1600,4/5/2004
1,Maia Garcia,606 Odio. Ave,expérimenté,cuisinier,1.0,1,164486,1600,3/5/2010
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",expérimenté,cuisinier,3.0,2,776532,1600,7/9/2020
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,expérimenté,cuisinier,0.0,3,37815,1600,26/11/2007
4,Indira Vega,152-5825 Urna Rd.,expérimenté,cuisinier,9.0,4,9318,1760,16/4/2006
...,...,...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,expérimenté,cuisinier,6.0,3640,164486,1680,10/8/2017
3641,Cally Burton,290-9064 Sed Rd.,expérimenté,cuisinier,5.0,3641,3725,1600,11/11/2015
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,expérimenté,cuisinier,5.0,3642,327537,1600,4/9/2007
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,expérimenté,cuisinier,2.0,3643,282669,1600,20/12/2008
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",expérimenté,cuisinier,7.0,3644,6479,1680,31/5/2019

In [96]:
df_employes_paie = df_employes

del df_employes_paie['nom']
del df_employes_paie['adresse']
del df_employes_paie['experience']
del df_employes_paie['poste']
del df_employes_paie['note']
del df_employes_paie['code_postal']

df_employes_paie = df_employes_paie.rename(columns={"date_entrée":"date"})

df_employes_paie

      id_employee  salaire_net        date
0               0         1600    4/5/2004
1               1         1600    3/5/2010
2               2         1600    7/9/2020
3               3         1600  26/11/2007
4               4         1760   16/4/2006
...           ...          ...         ...
3640         3640         1680   10/8/2017
3641         3641         1600  11/11/2015
3642         3642         1600    4/9/2007
3643         3643         1600  20/12/2008
3644         3644         1680   31/5/2019

[3645 rows x 3 columns]

In [97]:
df_employes_paie.to_sql(name='Paie', con=engine, if_exists = 'append', index=False)

2022-12-13 16:43:57,871 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Paie")
2022-12-13 16:43:57,872 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:43:57,874 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:43:57,885 INFO sqlalchemy.engine.Engine INSERT INTO "Paie" (id_employee, salaire_net, date) VALUES (?, ?, ?)
2022-12-13 16:43:57,886 INFO sqlalchemy.engine.Engine [generated in 0.00791s] ((0, 1600, '4/5/2004'), (1, 1600, '3/5/2010'), (2, 1600, '7/9/2020'), (3, 1600, '26/11/2007'), (4, 1760, '16/4/2006'), (5, 1600, '2/2/2001'), (6, 1600, '26/9/2016'), (7, 1600, '21/4/2018')  ... displaying 10 of 3645 total bound parameter sets ...  (3643, 1600, '20/12/2008'), (3644, 1680, '31/5/2019'))
2022-12-13 16:43:57,891 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:43:57,896 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:43:57,896 INFO sqlalchemy.engine.Engine [raw sql] ()

3645

## PANIER ITEM

In [98]:
df_item = df_item.reset_index()

del df_item['index']

df_item

             nom_item  prix     type
0            Plat n°1  4.84     plat
1            Plat n°2  5.83     plat
2            Plat n°3  4.34     plat
3            Plat n°4  3.65     plat
4            Plat n°5  3.75     plat
..                ...   ...      ...
124          vittel_g  1.48  boisson
125  san_pellegrino_g  2.24  boisson
126      jus_orange_g  2.98  boisson
127       jus_pomme_g  2.98  boisson
128       heinneken_g  4.49  boisson

[129 rows x 3 columns]

In [99]:
df_item.nom_item[0]

'Plat n°1'

In [100]:
ticket = 10000*[0]

df_panier_item = pd.DataFrame({"id_bill":ticket})

df_panier_item['id_bill'] = df_panier_item.index

df_panier_item

      id_bill
0           0
1           1
2           2
3           3
4           4
...       ...
9995     9995
9996     9996
9997     9997
9998     9998
9999     9999

[10000 rows x 1 columns]

In [101]:
df_panier_item['nom_item'] = ''

df_panier_item

      id_bill nom_item
0           0
1           1
2           2
3           3
4           4
...       ...      ...
9995     9995
9996     9996
9997     9997
9998     9998
9999     9999

[10000 rows x 2 columns]

In [102]:
for item in range (len(ticket)):
    df_panier_item.nom_item[item] = df_item.nom_item[rd.randint(0, len(df_item)-1)]

df_panier_item['quantité'] = 0
df_panier_item['quantité'] = df_panier_item['quantité'].apply(lambda x : rd.randint(1,10))

df_panier_item

/tmp/ipykernel_66828/893421340.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_panier_item.nom_item[item] = df_item.nom_item[rd.randint(0, len(df_item)-1)]

      id_bill      nom_item  quantité
0           0      vittel_p         1
1           1     Plat n°39         7
2           2      sprite_p         9
3           3  Dessert n°19         5
4           4  Dessert n°25         7
...       ...           ...       ...
9995     9995     Plat n°24         5
9996     9996  Dessert n°45         4
9997     9997     Plat n°48         3
9998     9998  Dessert n°14         8
9999     9999     Plat n°31         6

[10000 rows x 3 columns]

In [103]:
df_panier_item.to_sql(name='PanierItem', con=engine, if_exists = 'append', index=False)

2022-12-13 16:44:00,848 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("PanierItem")
2022-12-13 16:44:00,849 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:00,856 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:44:00,885 INFO sqlalchemy.engine.Engine INSERT INTO "PanierItem" (id_bill, nom_item, "quantité") VALUES (?, ?, ?)
2022-12-13 16:44:00,886 INFO sqlalchemy.engine.Engine [generated in 0.01983s] ((0, 'vittel_p', 1), (1, 'Plat n°39', 7), (2, 'sprite_p', 9), (3, 'Dessert n°19', 5), (4, 'Dessert n°25', 7), (5, 'Dessert n°41', 9), (6, 'Plat n°29', 9), (7, 'Plat n°14', 7)  ... displaying 10 of 10000 total bound parameter sets ...  (9998, 'Dessert n°14', 8), (9999, 'Plat n°31', 6))
2022-12-13 16:44:00,907 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:44:00,918 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:44:00,919 INFO sqlalchemy.engine.Engine [raw sql] ()

10000

In [104]:
df_menu

        plat           boisson       dessert  id_menu   prix
0   Plat n°9            coca_p  Dessert n°11        0  10.75
1  Plat n°38      jus_orange_g  Dessert n°29        1   7.81
2  Plat n°28          sprite_m  Dessert n°10        2   9.45
3  Plat n°49    fanta_orange_p  Dessert n°28        3   8.96
4  Plat n°29       heinneken_g  Dessert n°23        4  10.58
5  Plat n°31       heinneken_p  Dessert n°10        5  11.20
6   Plat n°2  san_pellegrino_p  Dessert n°19        6   9.59
7  Plat n°13    fanta_citron_p  Dessert n°19        7   9.04
8  Plat n°39       coca_zero_g   Dessert n°2        8   8.78
9  Plat n°40       coca_zero_p  Dessert n°16        9   7.61

## PANIER MENU

In [105]:
df_menu

        plat           boisson       dessert  id_menu   prix
0   Plat n°9            coca_p  Dessert n°11        0  10.75
1  Plat n°38      jus_orange_g  Dessert n°29        1   7.81
2  Plat n°28          sprite_m  Dessert n°10        2   9.45
3  Plat n°49    fanta_orange_p  Dessert n°28        3   8.96
4  Plat n°29       heinneken_g  Dessert n°23        4  10.58
5  Plat n°31       heinneken_p  Dessert n°10        5  11.20
6   Plat n°2  san_pellegrino_p  Dessert n°19        6   9.59
7  Plat n°13    fanta_citron_p  Dessert n°19        7   9.04
8  Plat n°39       coca_zero_g   Dessert n°2        8   8.78
9  Plat n°40       coca_zero_p  Dessert n°16        9   7.61

In [106]:
df_menu.id_menu[0]

0

In [107]:
df_panier_menu = pd.DataFrame({"id_bill":ticket})

df_panier_menu['id_bill'] = df_panier_menu.index

df_panier_menu

      id_bill
0           0
1           1
2           2
3           3
4           4
...       ...
9995     9995
9996     9996
9997     9997
9998     9998
9999     9999

[10000 rows x 1 columns]

In [108]:
df_panier_menu['id_menu'] = ''

df_panier_menu

      id_bill id_menu
0           0
1           1
2           2
3           3
4           4
...       ...     ...
9995     9995
9996     9996
9997     9997
9998     9998
9999     9999

[10000 rows x 2 columns]

In [109]:
for item in range (len(ticket)):
    df_panier_menu.id_menu[item] = int(df_menu.id_menu[rd.randint(0, len(df_menu)-1)])

df_panier_menu['quantité'] = 0
df_panier_menu['quantité'] = df_panier_menu['quantité'].apply(lambda x : rd.randint(1,10))

df_panier_menu

/tmp/ipykernel_66828/2167206073.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_panier_menu.id_menu[item] = int(df_menu.id_menu[rd.randint(0, len(df_menu)-1)])

      id_bill id_menu  quantité
0           0       0         3
1           1       2         7
2           2       5         5
3           3       6         4
4           4       0         5
...       ...     ...       ...
9995     9995       7         5
9996     9996       8         4
9997     9997       0         5
9998     9998       1         4
9999     9999       4         3

[10000 rows x 3 columns]

In [110]:
df_panier_menu.to_sql(name='PanierMenu', con=engine, if_exists = 'append', index=False)

2022-12-13 16:44:03,949 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("PanierMenu")
2022-12-13 16:44:03,951 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:03,954 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-13 16:44:03,977 INFO sqlalchemy.engine.Engine INSERT INTO "PanierMenu" (id_bill, id_menu, "quantité") VALUES (?, ?, ?)
2022-12-13 16:44:03,978 INFO sqlalchemy.engine.Engine [generated in 0.01762s] ((0, 0, 3), (1, 2, 7), (2, 5, 5), (3, 6, 4), (4, 0, 5), (5, 7, 6), (6, 3, 4), (7, 0, 2)  ... displaying 10 of 10000 total bound parameter sets ...  (9998, 1, 4), (9999, 4, 3))
2022-12-13 16:44:03,992 INFO sqlalchemy.engine.Engine COMMIT
2022-12-13 16:44:04,001 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-13 16:44:04,002 INFO sqlalchemy.engine.Engine [raw sql] ()

10000

## TICKET DE CAISSE

In [111]:
df_ticket = pd.io.sql.read_sql("select panierM.id_bill,panierM. id_menu, panierM.quantité as quantité_menu, menu.prix * panierM.quantité as prix_menu, panierI.quantité as quantité_item, panierI.nom_item, item.prix * panierI.quantité as prix_item from 'PanierMenu' as panierM join 'Menu' as menu on panierM.id_menu=menu.id_menu join 'PanierItem' as panierI on panierI.id_bill=panierM.id_bill join 'Item' as item on panierI.nom_item=item.nom_item", con=engine)

df_ticket

2022-12-13 16:44:04,044 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("select panierM.id_bill,panierM. id_menu, panierM.quantité as quantité_menu, menu.prix * panierM.quantité as prix_menu, panierI.quantité as quantité_item, panierI.nom_item, item.prix * panierI.quantité as prix_item from 'PanierMenu' as panierM join 'Menu' as menu on panierM.id_menu=menu.id_menu join 'PanierItem' as panierI on panierI.id_bill=panierM.id_bill join 'Item' as item on panierI.nom_item=item.nom_item")
2022-12-13 16:44:04,045 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:04,046 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("select panierM.id_bill,panierM. id_menu, panierM.quantité as quantité_menu, menu.prix * panierM.quantité as prix_menu, panierI.quantité as quantité_item, panierI.nom_item, item.prix * panierI.quantité as prix_item from 'PanierMenu' as panierM join 'Menu' as menu on panierM.id_menu=menu.id_menu join 'PanierItem' as panierI on panierI.id_bill=panierM.id_bill join 'Item' as item on panierI.nom_item=item.nom_item")
2022-12-13 16:44:04,047 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:04,049 INFO sqlalchemy.engine.Engine select panierM.id_bill,panierM. id_menu, panierM.quantité as quantité_menu, menu.prix * panierM.quantité as prix_menu, panierI.quantité as quantité_item, panierI.nom_item, item.prix * panierI.quantité as prix_item from 'PanierMenu' as panierM join 'Menu' as menu on panierM.id_menu=menu.id_menu join 'PanierItem' as panierI on panierI.id_bill=panierM.id_bill join 'Item' as item on panierI.nom_item=item.nom_item
2022-12-13 16:44:04,050 INFO sqlalchemy.engine.Engine [raw sql] ()

,id_bill,id_menu,quantité_menu,prix_menu,quantité_item,nom_item,prix_item
0,0,0,3,32.25,1,vittel_p,0.99
1,1,2,7,66.15,7,Plat n°39,39.41
2,2,5,5,56.00,9,sprite_p,8.91
3,3,6,4,38.36,5,Dessert n°19,16.65
4,4,0,5,53.75,7,Dessert n°25,15.75
...,...,...,...,...,...,...,...
9995,9995,7,5,45.20,5,Plat n°24,33.05
9996,9996,8,4,35.12,4,Dessert n°45,16.92
9997,9997,0,5,53.75,3,Plat n°48,16.86
9998,9998,1,4,31.24,8,Dessert n°14,33.84
9999,9999,4,3,31.74,6,Plat n°31,31.32

In [112]:
df_ticket['prix_total'] = 0

df_ticket

,id_bill,id_menu,quantité_menu,prix_menu,quantité_item,nom_item,prix_item,prix_total
0,0,0,3,32.25,1,vittel_p,0.99,0
1,1,2,7,66.15,7,Plat n°39,39.41,0
2,2,5,5,56.00,9,sprite_p,8.91,0
3,3,6,4,38.36,5,Dessert n°19,16.65,0
4,4,0,5,53.75,7,Dessert n°25,15.75,0
...,...,...,...,...,...,...,...,...
9995,9995,7,5,45.20,5,Plat n°24,33.05,0
9996,9996,8,4,35.12,4,Dessert n°45,16.92,0
9997,9997,0,5,53.75,3,Plat n°48,16.86,0
9998,9998,1,4,31.24,8,Dessert n°14,33.84,0
9999,9999,4,3,31.74,6,Plat n°31,31.32,0

In [113]:
for prix in range (len(ticket)):
    df_ticket.prix_total[prix] = df_ticket.prix_menu[prix] + df_ticket.prix_item[prix]

df_ticket

/tmp/ipykernel_66828/4072283549.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ticket.prix_total[prix] = df_ticket.prix_menu[prix] + df_ticket.prix_item[prix]

,id_bill,id_menu,quantité_menu,prix_menu,quantité_item,nom_item,prix_item,prix_total
0,0,0,3,32.25,1,vittel_p,0.99,33.24
1,1,2,7,66.15,7,Plat n°39,39.41,105.56
2,2,5,5,56.00,9,sprite_p,8.91,64.91
3,3,6,4,38.36,5,Dessert n°19,16.65,55.01
4,4,0,5,53.75,7,Dessert n°25,15.75,69.50
...,...,...,...,...,...,...,...,...
9995,9995,7,5,45.20,5,Plat n°24,33.05,78.25
9996,9996,8,4,35.12,4,Dessert n°45,16.92,52.04
9997,9997,0,5,53.75,3,Plat n°48,16.86,70.61
9998,9998,1,4,31.24,8,Dessert n°14,33.84,65.08
9999,9999,4,3,31.74,6,Plat n°31,31.32,63.06

In [114]:
del df_ticket['id_menu']
del df_ticket['quantité_menu']
del df_ticket['prix_menu']
del df_ticket['nom_item']
del df_ticket['quantité_item']
del df_ticket['prix_item']

df_ticket

      id_bill  prix_total
0           0       33.24
1           1      105.56
2           2       64.91
3           3       55.01
4           4       69.50
...       ...         ...
9995     9995       78.25
9996     9996       52.04
9997     9997       70.61
9998     9998       65.08
9999     9999       63.06

[10000 rows x 2 columns]

In [115]:
df_ticket['moyen_paiement'] = "a"
df_ticket['borne'] = 0

df_ticket

      id_bill  prix_total moyen_paiement  borne
0           0       33.24              a      0
1           1      105.56              a      0
2           2       64.91              a      0
3           3       55.01              a      0
4           4       69.50              a      0
...       ...         ...            ...    ...
9995     9995       78.25              a      0
9996     9996       52.04              a      0
9997     9997       70.61              a      0
9998     9998       65.08              a      0
9999     9999       63.06              a      0

[10000 rows x 4 columns]

In [116]:
def paiement (e):
    alea = rd.randint(1,4)
    if alea == 1:
        e = "espece"
    else :
        e = "cb"
    return e

In [117]:
df_ticket['moyen_paiement'] = df_ticket['moyen_paiement'].apply(lambda x : paiement(x))

df_ticket

      id_bill  prix_total moyen_paiement  borne
0           0       33.24             cb      0
1           1      105.56         espece      0
2           2       64.91             cb      0
3           3       55.01         espece      0
4           4       69.50             cb      0
...       ...         ...            ...    ...
9995     9995       78.25         espece      0
9996     9996       52.04             cb      0
9997     9997       70.61             cb      0
9998     9998       65.08             cb      0
9999     9999       63.06         espece      0

[10000 rows x 4 columns]

In [118]:
for paiement in range (len(ticket)):
    alea = rd.randint(1,3)
    if df_ticket.moyen_paiement[paiement] == "espece":
        df_ticket.borne[paiement] = 0
    else :
        if alea == 1:
            df_ticket.borne[paiement] = 0
        else :
            df_ticket.borne[paiement] = 1
            
df_ticket['code_postal'] = "a"
df_ticket['id_vendeur'] = 0

df_ticket

/tmp/ipykernel_66828/3805755198.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ticket.borne[paiement] = 1
/tmp/ipykernel_66828/3805755198.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ticket.borne[paiement] = 0
/tmp/ipykernel_66828/3805755198.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ticket.borne[paiement] = 0

      id_bill  prix_total moyen_paiement  borne code_postal  id_vendeur
0           0       33.24             cb      1           a           0
1           1      105.56         espece      0           a           0
2           2       64.91             cb      1           a           0
3           3       55.01         espece      0           a           0
4           4       69.50             cb      0           a           0
...       ...         ...            ...    ...         ...         ...
9995     9995       78.25         espece      0           a           0
9996     9996       52.04             cb      0           a           0
9997     9997       70.61             cb      0           a           0
9998     9998       65.08             cb      0           a           0
9999     9999       63.06         espece      0           a           0

[10000 rows x 6 columns]

In [119]:
for ticket in range (len(ticket)):
    df_ticket.code_postal[ticket] = code_postal[rd.randint(0, len(code_postal)-1)]

df_ticket

/tmp/ipykernel_66828/2773671831.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ticket.code_postal[ticket] = code_postal[rd.randint(0, len(code_postal)-1)]

      id_bill  prix_total moyen_paiement  borne code_postal  id_vendeur
0           0       33.24             cb      1      547166           0
1           1      105.56         espece      0       42763           0
2           2       64.91             cb      1     8876 JU           0
3           3       55.01         espece      0       87406           0
4           4       69.50             cb      0      253842           0
...       ...         ...            ...    ...         ...         ...
9995     9995       78.25         espece      0       53782           0
9996     9996       52.04             cb      0        6738           0
9997     9997       70.61             cb      0        7819           0
9998     9998       65.08             cb      0     8481 KH           0
9999     9999       63.06         espece      0      604113           0

[10000 rows x 6 columns]

In [120]:
df_employes_copy

,nom,adresse,experience,poste,note,id_employee,code_postal
0,Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042
1,Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486
2,Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532
3,Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815
4,Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318
...,...,...,...,...,...,...,...
3640,Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486
3641,Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725
3642,Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537
3643,Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669
3644,Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479

In [121]:
code_employee = pd.io.sql.read_sql("select resto.code_postal, employee.nom from 'Restaurant' as resto join 'Employee' as employee on resto.code_postal=employee.code_postal order by resto.code_postal", con=engine)

code_employee

2022-12-13 16:44:10,292 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("select resto.code_postal, employee.nom from 'Restaurant' as resto join 'Employee' as employee on resto.code_postal=employee.code_postal order by resto.code_postal")
2022-12-13 16:44:10,293 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:10,295 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("select resto.code_postal, employee.nom from 'Restaurant' as resto join 'Employee' as employee on resto.code_postal=employee.code_postal order by resto.code_postal")
2022-12-13 16:44:10,296 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-13 16:44:10,297 INFO sqlalchemy.engine.Engine select resto.code_postal, employee.nom from 'Restaurant' as resto join 'Employee' as employee on resto.code_postal=employee.code_postal order by resto.code_postal
2022-12-13 16:44:10,298 INFO sqlalchemy.engine.Engine [raw sql] ()

     code_postal               nom
0          01779      Cole Richard
1          01779       Lev Burgess
2          01779  Gillian Mccarthy
3          01779       Jarrod Webb
4          01779      Jorden Gibbs
...          ...               ...
3640     d1R 4E2      Eagan George
3641     d1R 4E2   Noelle Matthews
3642     d1R 4E2      Scott Mathis
3643     d1R 4E2       Vance Patel
3644     d1R 4E2        Dante Neal

[3645 rows x 2 columns]

In [122]:
code_employee = code_employee.reset_index()

code_employee

      index code_postal               nom
0         0       01779      Cole Richard
1         1       01779       Lev Burgess
2         2       01779  Gillian Mccarthy
3         3       01779       Jarrod Webb
4         4       01779      Jorden Gibbs
...     ...         ...               ...
3640   3640     d1R 4E2      Eagan George
3641   3641     d1R 4E2   Noelle Matthews
3642   3642     d1R 4E2      Scott Mathis
3643   3643     d1R 4E2       Vance Patel
3644   3644     d1R 4E2        Dante Neal

[3645 rows x 3 columns]

In [123]:
dict_employee = []

for employee in range (len(code_employee)):
    dict_employee.append({
        "nom": code_employee.nom[employee],
        "code_postal": code_employee.code_postal[employee]
    })

dict_employee

[{'nom': 'Cole Richard', 'code_postal': '01779'},
 {'nom': 'Lev Burgess', 'code_postal': '01779'},
 {'nom': 'Gillian Mccarthy', 'code_postal': '01779'},
 {'nom': 'Jarrod Webb', 'code_postal': '01779'},
 {'nom': 'Jorden Gibbs', 'code_postal': '01779'},
 {'nom': 'Wynter Duffy', 'code_postal': '01779'},
 {'nom': 'Kyra Sampson', 'code_postal': '01779'},
 {'nom': 'Yuli Trujillo', 'code_postal': '01779'},
 {'nom': 'Hiroko Tillman', 'code_postal': '01779'},
 {'nom': 'Kai Duffy', 'code_postal': '01779'},
 {'nom': 'Whoopi Compton', 'code_postal': '01779'},
 {'nom': 'Harlan Roman', 'code_postal': '01779'},
 {'nom': 'Lars Charles', 'code_postal': '01779'},
 {'nom': 'Lucian Hurst', 'code_postal': '01779'},
 {'nom': 'Megan Mooney', 'code_postal': '01779'},
 {'nom': 'Shoshana James', 'code_postal': '01779'},
 {'nom': 'Macaulay Salinas', 'code_postal': '01779'},
 {'nom': 'Vincent Cantu', 'code_postal': '02653'},
 {'nom': 'Karina Lawrence', 'code_postal': '02653'},
 {'nom': 'Nissim Wilcox', 'code_postal': '02653'},
 {'nom': 'Harrison Lowe', 'code_postal': '02653'},
 {'nom': 'Sylvester Santana', 'code_postal': '02653'},
 {'nom': 'Iona Weber', 'code_postal': '02653'},
 {'nom': 'Haviva Burks', 'code_postal': '02653'},
 {'nom': 'Maggy Sherman', 'code_postal': '02653'},
 {'nom': 'Thomas Booker', 'code_postal': '02653'},
 {'nom': 'Lynn Simpson', 'code_postal': '02653'},
 {'nom': 'Marshall Walsh', 'code_postal': '02653'},
 {'nom': 'Ian Nunez', 'code_postal': '02653'},
 {'nom': 'Jessamine Kirby', 'code_postal': '02653'},
 {'nom': 'Emmanuel Wright', 'code_postal': '0381'},
 {'nom': 'Irma Sanford', 'code_postal': '0381'},
 {'nom': 'Brittany Alexander', 'code_postal': '0381'},
 {'nom': 'Jakeem Keller', 'code_postal': '0381'},
 {'nom': 'Kaseem Peters', 'code_postal': '0381'},
 {'nom': 'Hillary David', 'code_postal': '0381'},
 {'nom': 'Iona Bush', 'code_postal': '0381'},
 {'nom': 'Maggy Carver', 'code_postal': '0381'},
 {'nom': 'Jason Montgomery', 'code_postal': '0381'},
 {'nom': 'Bo Stewart', 'code_postal': '0381'},
 {'nom': 'Demetrius Lamb', 'code_postal': '0381'},
 {'nom': 'Dylan Freeman', 'code_postal': '0381'},
 {'nom': 'Kirsten Puckett', 'code_postal': '0381'},
 {'nom': 'Alan Kirkland', 'code_postal': '0381'},
 {'nom': 'Thomas Ballard', 'code_postal': '0381'},
 {'nom': 'Alan Thomas', 'code_postal': '0381'},
 {'nom': 'Jamal Pugh', 'code_postal': '0381'},
 {'nom': 'Duncan Valentine', 'code_postal': '0381'},
 {'nom': 'Callum Dalton', 'code_postal': '0381'},
 {'nom': 'Florence Hines', 'code_postal': '0557'},
 {'nom': 'Ora Rosa', 'code_postal': '0557'},
 {'nom': 'Dale Bowers', 'code_postal': '0557'},
 {'nom': 'Honorato Fields', 'code_postal': '0557'},
 {'nom': 'Adrian Clay', 'code_postal': '0557'},
 {'nom': 'Hiram Howard', 'code_postal': '0557'},
 {'nom': 'Lewis Weeks', 'code_postal': '0557'},
 {'nom': 'Nash Carson', 'code_postal': '0557'},
 {'nom': 'Kai Osborn', 'code_postal': '0557'},
 {'nom': 'Jason Hudson', 'code_postal': '0557'},
 {'nom': 'Alfonso Marks', 'code_postal': '0557'},
 {'nom': 'Cade Henson', 'code_postal': '0557'},
 {'nom': 'Nina Keith', 'code_postal': '0557'},
 {'nom': 'Xaviera Mercado', 'code_postal': '0557'},
 {'nom': 'Lisandra Moreno', 'code_postal': '0557'},
 {'nom': 'Elmo Morrison', 'code_postal': '0557'},
 {'nom': 'Zelenia Nichols', 'code_postal': '0557'},
 {'nom': 'Quail Holland', 'code_postal': '0557'},
 {'nom': 'Autumn Lyons', 'code_postal': '06-728'},
 {'nom': 'Elmo Sparks', 'code_postal': '06-728'},
 {'nom': 'Carol Jensen', 'code_postal': '06-728'},
 {'nom': 'Hoyt Davidson', 'code_postal': '06-728'},
 {'nom': 'Drake Sosa', 'code_postal': '06-728'},
 {'nom': 'Zeph Santiago', 'code_postal': '06-728'},
 {'nom': 'Todd Guthrie', 'code_postal': '06-728'},
 {'nom': 'Cara Gomez', 'code_postal': '06-728'},
 {'nom': 'Ivor Hamilton', 'code_postal': '06-728'},
 {'nom': 'Buffy Leonard', 'code_postal': '06-728'},
 {'nom': 'Leonard Glover', 'code_postal': '06-887'},
 {'nom': 'Sawyer Acevedo', 'code_postal': '06-887'},
 {'nom': 'Irene Lyons', 'code_postal': '06-887'},
 {'nom': 'Rae Stanton', 'code_postal': '06-887'},
 {'nom': 'Edan Wooten', 'code_postal': '06-887'},
 {'nom': 'Inez Fernandez', 'code_postal': '06-887'},
 {'nom': 'Vaughan Pace', 'code_postal': '06-887'},
 {'nom': 'Addison Baxter', 'code_postal': '06-887'},
 {'nom': 'Clementine Meadows', 'code_postal': '065836'},
 {'nom': 'Hyacinth Koch', 'code_postal': '065836'},
 {'nom': 'Gannon Beasley', 'code_postal': '065836'},
 {'nom': 'Cain Palmer', 'code_postal': '065836'},
 {'nom': 'Camilla Sloan', 'code_postal': '065836'},
 {'nom': 'Alexandra Gentry', 'code_postal': '065836'},
 {'nom': 'Rigel Barnett', 'code_postal': '065836'},
 {'nom': 'Melyssa Tate', 'code_postal': '065836'},
 {'nom': 'Kirk Ashley', 'code_postal': '065836'},
 {'nom': 'Hilel Woodward', 'code_postal': '08-175'},
 {'nom': 'Paula Grant', 'code_postal': '08-175'},
 {'nom': 'Solomon Le', 'code_postal': '08-175'},
 {'nom': 'Mariko Armstrong', 'code_postal': '08-175'},
 {'nom': 'Kato Hood', 'code_postal': '08-175'},
 {'nom': 'Fulton Snow', 'code_postal': '08-175'},
 {'nom': 'Vivian Sampson', 'code_postal': '08-175'},
 {'nom': 'Georgia Huber', 'code_postal': '08-175'},
 {'nom': 'Clementine Best', 'code_postal': '08-175'},
 {'nom': 'Amal Pate', 'code_postal': '08-175'},
 {'nom': 'Sopoline Horne', 'code_postal': '08-175'},
 {'nom': 'Amaya Wheeler', 'code_postal': '08-175'},
 {'nom': 'Timothy Hall', 'code_postal': '08-175'},
 {'nom': 'Zephania Cain', 'code_postal': '08-175'},
 {'nom': 'Marvin Hurley', 'code_postal': '0885'},
 {'nom': 'Ayanna Harrell', 'code_postal': '0885'},
 {'nom': 'Idona Zamora', 'code_postal': '0885'},
 {'nom': 'Nissim Mayer', 'code_postal': '0885'},
 {'nom': 'Garth Vinson', 'code_postal': '0885'},
 {'nom': 'Sean Malone', 'code_postal': '0885'},
 {'nom': 'Quinn Rodriguez', 'code_postal': '0983 VX'},
 {'nom': 'Kaseem Pate', 'code_postal': '0983 VX'},
 {'nom': 'Portia Meyer', 'code_postal': '0983 VX'},
 {'nom': 'Callie Olsen', 'code_postal': '0983 VX'},
 {'nom': 'Jordan Coleman', 'code_postal': '0983 VX'},
 {'nom': 'Wendy Mcknight', 'code_postal': '0983 VX'},
 {'nom': 'Andrew Head', 'code_postal': '0983 VX'},
 {'nom': 'Griffith Durham', 'code_postal': '0983 VX'},
 {'nom': 'Sharon Frazier', 'code_postal': '0983 VX'},
 {'nom': 'Margaret Witt', 'code_postal': '0983 VX'},
 {'nom': 'Damon Brady', 'code_postal': '0983 VX'},
 {'nom': 'Griffith Malone', 'code_postal': '0983 VX'},
 {'nom': 'Clinton Bennett', 'code_postal': '0983 VX'},
 {'nom': 'Linda Carney', 'code_postal': '0983 VX'},
 {'nom': 'Jonas Conley', 'code_postal': '0983 VX'},
 {'nom': 'Akeem Ortega', 'code_postal': '0983 VX'},
 {'nom': 'Portia Jenkins', 'code_postal': '0983 VX'},
 {'nom': 'Zelda Maddox', 'code_postal': '0983 VX'},
 {'nom': 'Whoopi Fernandez', 'code_postal': '0983 VX'},
 {'nom': 'Haviva Schroeder', 'code_postal': '0983 VX'},
 {'nom': 'Zane Gibbs', 'code_postal': '0983 VX'},
 {'nom': 'Gretchen Santiago', 'code_postal': '10114'},
 {'nom': 'Portia Stevenson', 'code_postal': '10114'},
 {'nom': 'Malachi Hayes', 'code_postal': '10114'},
 {'nom': 'Clarke Solis', 'code_postal': '10114'},
 {'nom': 'Graiden Blair', 'code_postal': '10114'},
 {'nom': 'Acton Hawkins', 'code_postal': '10114'},
 {'nom': 'Nyssa Newman', 'code_postal': '10114'},
 {'nom': 'Madaline Klein', 'code_postal': '10114'},
 {'nom': 'Acton Workman', 'code_postal': '10114'},
 {'nom': 'Adena Dudley', 'code_postal': '10114'},
 {'nom': 'Levi Haley', 'code_postal': '10114'},
 {'nom': 'Xander Mcfarland', 'code_postal': '10114'},
 {'nom': 'Ian Harrington', 'code_postal': '10114'},
 {'nom': 'Lilah Benson', 'code_postal': '11111'},
 {'nom': 'Kay Ramsey', 'code_postal': '11111'},
 {'nom': 'Avram Preston', 'code_postal': '11111'},
 {'nom': 'Jerry Workman', 'code_postal': '11111'},
 {'nom': 'Tatiana Lee', 'code_postal': '11111'},
 {'nom': 'Sylvester Miles', 'code_postal': '11111'},
 {'nom': 'Porter Maxwell', 'code_postal': '11111'},
 {'nom': 'Shelley Neal', 'code_postal': '11111'},
 {'nom': 'Cameron Kramer', 'code_postal': '11111'},
 {'nom': 'Keelie Schneider', 'code_postal': '11111'},
 {'nom': 'Jescie Craft', 'code_postal': '11111'},
 {'nom': 'Tucker Blake', 'code_postal': '11111'},
 {'nom': 'Brittany Beasley', 'code_postal': '11111'},
 {'nom': 'Anthony Alvarez', 'code_postal': '11111'},
 {'nom': 'Lars Avery', 'code_postal': '11111'},
 {'nom': 'Teegan Calderon', 'code_postal': '11111'},
 {'nom': 'Joseph Tyson', 'code_postal': '11111'},
 {'nom': 'Channing Chase', 'code_postal': '11626'},
 {'nom': 'Charles Franklin', 'code_postal': '11626'},
 {'nom': 'Aquila Compton', 'code_postal': '11626'},
 {'nom': 'Dean Clarke', 'code_postal': '11626'},
 {'nom': 'Mona Manning', 'code_postal': '11626'},
 {'nom': 'Sigourney Battle', 'code_postal': '11626'},
 {'nom': 'Emma Williamson', 'code_postal': '11626'},
 {'nom': 'Jermaine Weber', 'code_postal': '11626'},
 {'nom': 'Grant Bryan', 'code_postal': '11626'},
 {'nom': "Darryl O'brien", 'code_postal': '11626'},
 {'nom': 'Odysseus Kemp', 'code_postal': '11626'},
 {'nom': 'Tanisha Sweeney', 'code_postal': '11626'},
 {'nom': 'Mark Valentine', 'code_postal': '1165 PU'},
 {'nom': 'Marcia Fitzgerald', 'code_postal': '1165 PU'},
 {'nom': 'Ezekiel Gilbert', 'code_postal': '1165 PU'},
 {'nom': 'Rudyard Collier', 'code_postal': '1165 PU'},
 {'nom': 'Kessie Wong', 'code_postal': '1165 PU'},
 {'nom': 'Nevada Walker', 'code_postal': '1165 PU'},
 {'nom': 'Isadora Rivers', 'code_postal': '1165 PU'},
 {'nom': 'Emmanuel Hill', 'code_postal': '1165 PU'},
 {'nom': 'Ria Charles', 'code_postal': '1165 PU'},
 {'nom': 'Erasmus Mejia', 'code_postal': '1165 PU'},
 {'nom': 'Karen Pacheco', 'code_postal': '1165 PU'},
 {'nom': 'Quynn Mccarthy', 'code_postal': '1165 PU'},
 {'nom': 'Nadine Greer', 'code_postal': '11827'},
 {'nom': 'Rooney Ramirez', 'code_postal': '11827'},
 {'nom': 'Demetrius Hampton', 'code_postal': '11827'},
 {'nom': 'Tanek Sampson', 'code_postal': '11827'},
 {'nom': 'Leonard Farmer', 'code_postal': '11827'},
 {'nom': 'Andrew Blanchard', 'code_postal': '11827'},
 {'nom': 'Ezekiel Kline', 'code_postal': '11827'},
 {'nom': 'Elvis Harris', 'code_postal': '11827'},
 {'nom': 'Ulysses Chambers', 'code_postal': '11827'},
 {'nom': 'Olivia Beach', 'code_postal': '11827'},
 {'nom': 'Shelly Dotson', 'code_postal': '11827'},
 {'nom': 'Raja Dickerson', 'code_postal': '11827'},
 {'nom': 'Kelsey Bradford', 'code_postal': '11827'},
 {'nom': 'Vivian Curtis', 'code_postal': '11827'},
 {'nom': 'Neil Smith', 'code_postal': '11827'},
 {'nom': 'Xyla Pitts', 'code_postal': '11827'},
 {'nom': 'Kameko Baird', 'code_postal': '12122'},
 {'nom': 'Charlotte Conley', 'code_postal': '12122'},
 {'nom': 'Evan Talley', 'code_postal': '12122'},
 {'nom': 'Cole Wright', 'code_postal': '12122'},
 {'nom': 'Denton Summers', 'code_postal': '12122'},
 {'nom': 'Laurel Herring', 'code_postal': '12122'},
 {'nom': 'Rahim Livingston', 'code_postal': '12122'},
 {'nom': 'Erin Cooley', 'code_postal': '12122'},
 {'nom': 'Brock Clark', 'code_postal': '12122'},
 {'nom': 'Virginia Bryant', 'code_postal': '12122'},
 {'nom': 'Alea Chapman', 'code_postal': '12122'},
 {'nom': 'Vance Collier', 'code_postal': '12122'},
 {'nom': 'Warren Shelton', 'code_postal': '12122'},
 {'nom': 'Oren Rich', 'code_postal': '12122'},
 {'nom': 'Constance Mathews', 'code_postal': '12122'},
 {'nom': 'Lance Walls', 'code_postal': '12122'},
 {'nom': 'Audrey Workman', 'code_postal': '12122'},
 {'nom': 'Skyler Hayden', 'code_postal': '12122'},
 {'nom': 'Brennan Butler', 'code_postal': '12122'},
 {'nom': 'Kirby Mcdowell', 'code_postal': '12122'},
 {'nom': 'Cheryl Dominguez', 'code_postal': '12122'},
 {'nom': 'Naida Castillo', 'code_postal': '12177'},
 {'nom': 'Hayley Stewart', 'code_postal': '12177'},
 {'nom': 'Jaime Giles', 'code_postal': '12177'},
 {'nom': 'Sylvia Ellison', 'code_postal': '12177'},
 {'nom': 'Reagan Santiago', 'code_postal': '12177'},
 {'nom': 'Kenyon Wood', 'code_postal': '12177'},
 {'nom': 'Destiny Miles', 'code_postal': '12177'},
 {'nom': 'Xyla Rutledge', 'code_postal': '12177'},
 {'nom': 'Dai Thompson', 'code_postal': '12508'},
 {'nom': 'Melyssa Preston', 'code_postal': '12508'},
 {'nom': 'Grant Sandoval', 'code_postal': '12508'},
 {'nom': 'Gillian Harrison', 'code_postal': '12508'},
 {'nom': 'Aurelia Mcbride', 'code_postal': '12508'},
 {'nom': 'Harriet Miles', 'code_postal': '12508'},
 {'nom': 'Ora Sharp', 'code_postal': '12508'},
 {'nom': 'Michael Lowe', 'code_postal': '12508'},
 {'nom': 'Thomas Bonner', 'code_postal': '12508'},
 {'nom': 'Burke Cooke', 'code_postal': '12508'},
 {'nom': 'Nyssa Roman', 'code_postal': '12508'},
 {'nom': 'Odessa Orr', 'code_postal': '12508'},
 {'nom': 'Mary Travis', 'code_postal': '12508'},
 {'nom': 'Beau Underwood', 'code_postal': '12508'},
 {'nom': 'Alexander Ryan', 'code_postal': '12727-178'},
 {'nom': 'Patrick Davidson', 'code_postal': '12727-178'},
 {'nom': 'Sage Parks', 'code_postal': '12727-178'},
 {'nom': 'Laurel Morin', 'code_postal': '12727-178'},
 {'nom': 'Naida Justice', 'code_postal': '12727-178'},
 {'nom': 'Ariana Delaney', 'code_postal': '12727-178'},
 {'nom': 'Nayda Park', 'code_postal': '12727-178'},
 {'nom': 'Trevor Mason', 'code_postal': '12727-178'},
 {'nom': 'Kessie Atkins', 'code_postal': '12727-178'},
 {'nom': 'Alyssa England', 'code_postal': '12727-178'},
 {'nom': 'Whilemina Harper', 'code_postal': '12727-178'},
 {'nom': 'Talon Cox', 'code_postal': '12727-178'},
 {'nom': 'Keith Ford', 'code_postal': '12727-178'},
 {'nom': 'Rhiannon Battle', 'code_postal': '12727-178'},
 {'nom': 'Shad Hebert', 'code_postal': '12727-178'},
 {'nom': 'Quail Hinton', 'code_postal': '12737'},
 {'nom': 'Flynn Sloan', 'code_postal': '12737'},
 {'nom': 'Trevor Torres', 'code_postal': '12737'},
 {'nom': 'Paki Kelly', 'code_postal': '12737'},
 {'nom': 'Ruth Gill', 'code_postal': '12737'},
 {'nom': 'Ruth Woodard', 'code_postal': '12737'},
 {'nom': 'Chanda Reed', 'code_postal': '12737'},
 {'nom': 'Laura Pitts', 'code_postal': '12737'},
 {'nom': 'Lance Marsh', 'code_postal': '12737'},
 {'nom': 'Yuli Mcpherson', 'code_postal': '12737'},
 {'nom': 'Hayley Cline', 'code_postal': '12737'},
 {'nom': 'Fletcher Parsons', 'code_postal': '12737'},
 {'nom': 'Abra Tucker', 'code_postal': '12737'},
 {'nom': 'Dalton Garrett', 'code_postal': '12737'},
 {'nom': 'Oleg Carr', 'code_postal': '12737'},
 {'nom': 'Hamish Santana', 'code_postal': '13275'},
 {'nom': 'Harper Harding', 'code_postal': '13275'},
 {'nom': 'Ferdinand William', 'code_postal': '13275'},
 {'nom': 'Kasimir Hines', 'code_postal': '13275'},
 {'nom': 'Olympia Grant', 'code_postal': '13275'},
 {'nom': 'Jescie Cobb', 'code_postal': '13275'},
 {'nom': 'Jin Durham', 'code_postal': '13275'},
 {'nom': 'Rae Middleton', 'code_postal': '13275'},
 {'nom': 'Colt Mejia', 'code_postal': '13275'},
 {'nom': 'Yoko White', 'code_postal': '13275'},
 {'nom': 'Evelyn Phelps', 'code_postal': '13275'},
 {'nom': 'Lacota Snider', 'code_postal': '13275'},
 {'nom': 'Dolan Leon', 'code_postal': '13275'},
 {'nom': 'Hilel Hardin', 'code_postal': '13275'},
 {'nom': 'Ryan Doyle', 'code_postal': '13275'},
 {'nom': 'Mari Cruz', 'code_postal': '138261'},
 {'nom': 'Jin Watkins', 'code_postal': '138261'},
 {'nom': 'Vivian Simpson', 'code_postal': '138261'},
 {'nom': 'Thor Stephenson', 'code_postal': '138261'},
 {'nom': 'Cara Joseph', 'code_postal': '138261'},
 {'nom': 'Daquan Durham', 'code_postal': '138261'},
 {'nom': 'Ivana Wise', 'code_postal': '138261'},
 {'nom': 'Jada Cannon', 'code_postal': '138261'},
 {'nom': 'Adele Weaver', 'code_postal': '138261'},
 {'nom': 'Hu Espinoza', 'code_postal': '138261'},
 {'nom': 'Lois Frazier', 'code_postal': '138261'},
 {'nom': 'Sebastian Barr', 'code_postal': '138261'},
 {'nom': 'Hasad Kirk', 'code_postal': '138261'},
 {'nom': 'Patience Sanders', 'code_postal': '138261'},
 {'nom': 'Peter Giles', 'code_postal': '143835'},
 {'nom': 'Liberty Weiss', 'code_postal': '143835'},
 {'nom': 'Cruz Cardenas', 'code_postal': '143835'},
 {'nom': 'Lamar Mooney', 'code_postal': '143835'},
 {'nom': 'Ethan Jimenez', 'code_postal': '143835'},
 {'nom': 'Nathaniel Peterson', 'code_postal': '143835'},
 {'nom': 'Quintessa Mccarty', 'code_postal': '143835'},
 {'nom': 'Nigel Landry', 'code_postal': '143835'},
 {'nom': 'Scott Camacho', 'code_postal': '143835'},
 {'nom': 'Kyla Coleman', 'code_postal': '143835'},
 {'nom': 'Briar Phillips', 'code_postal': '143835'},
 {'nom': 'Griffin Harris', 'code_postal': '143835'},
 {'nom': 'Mark Nixon', 'code_postal': '143835'},
 {'nom': 'Kirestin Savage', 'code_postal': '143835'},
 {'nom': 'Jerry Woodward', 'code_postal': '143835'},
 {'nom': 'Mona Munoz', 'code_postal': '143835'},
 {'nom': 'Byron Moss', 'code_postal': '143835'},
 {'nom': 'Shelby Best', 'code_postal': '143835'},
 {'nom': 'Elton Reeves', 'code_postal': '143835'},
 {'nom': 'Lars Booker', 'code_postal': '143835'},
 {'nom': 'Maggie Guthrie', 'code_postal': '14958'},
 {'nom': 'Alisa Kirkland', 'code_postal': '14958'},
 {'nom': 'Kermit Cabrera', 'code_postal': '14958'},
 {'nom': 'Hunter Mosley', 'code_postal': '14958'},
 {'nom': 'Rajah Hanson', 'code_postal': '14958'},
 {'nom': 'Francesca Combs', 'code_postal': '14958'},
 {'nom': 'Rebecca Moreno', 'code_postal': '14958'},
 {'nom': 'Maris Jefferson', 'code_postal': '14958'},
 {'nom': 'Arthur Sanford', 'code_postal': '14958'},
 {'nom': 'Allegra Wolfe', 'code_postal': '14958'},
 {'nom': 'Jenette Serrano', 'code_postal': '14958'},
 {'nom': 'Winter Caldwell', 'code_postal': '14958'},
 {'nom': 'Dominique Holland', 'code_postal': '14958'},
 {'nom': 'Craig Diaz', 'code_postal': '14958'},
 {'nom': 'Hedy Gilmore', 'code_postal': '14958'},
 {'nom': 'Julie Fletcher', 'code_postal': '1522'},
 {'nom': 'Janna Lyons', 'code_postal': '1522'},
 {'nom': 'Ayanna Collins', 'code_postal': '1522'},
 {'nom': 'Zahir Carver', 'code_postal': '1522'},
 {'nom': 'George Francis', 'code_postal': '1522'},
 {'nom': 'Laith Holcomb', 'code_postal': '1522'},
 {'nom': 'Nomlanga Gentry', 'code_postal': '1522'},
 {'nom': 'Phoebe Becker', 'code_postal': '1522'},
 {'nom': 'Howard Noble', 'code_postal': '1522'},
 {'nom': 'Cathleen Figueroa', 'code_postal': '1522'},
 {'nom': 'Nero Henderson', 'code_postal': '1522'},
 {'nom': 'Stuart Booth', 'code_postal': '1522'},
 {'nom': 'Whilemina Freeman', 'code_postal': '1522'},
 {'nom': 'Iola Chavez', 'code_postal': '1522'},
 {'nom': 'Jenette Hamilton', 'code_postal': '1522'},
 {'nom': 'Urielle Mcbride', 'code_postal': '1522'},
 {'nom': 'Kirsten Landry', 'code_postal': '153293'},
 {'nom': "Whilemina O'brien", 'code_postal': '153293'},
 {'nom': 'Teagan Terrell', 'code_postal': '153293'},
 {'nom': 'Rhona Blanchard', 'code_postal': '153293'},
 {'nom': 'Kiara Allen', 'code_postal': '153293'},
 {'nom': 'James Bruce', 'code_postal': '153293'},
 {'nom': 'Adria Gordon', 'code_postal': '153293'},
 {'nom': 'Yvonne Luna', 'code_postal': '153293'},
 {'nom': 'Merrill Wall', 'code_postal': '153293'},
 {'nom': 'Plato Knight', 'code_postal': '1617'},
 {'nom': 'Shelly Wall', 'code_postal': '1617'},
 {'nom': 'Lester Ewing', 'code_postal': '1617'},
 {'nom': 'James Leon', 'code_postal': '1617'},
 {'nom': 'Linda Jordan', 'code_postal': '1617'},
 {'nom': 'Caryn Adkins', 'code_postal': '1617'},
 {'nom': 'Jael Mcbride', 'code_postal': '1617'},
 {'nom': 'Maxine Olson', 'code_postal': '1617'},
 {'nom': 'Cecilia Harris', 'code_postal': '1617'},
 {'nom': 'Moses Fleming', 'code_postal': '1617'},
 {'nom': 'Kenyon Shepard', 'code_postal': '1617'},
 {'nom': 'Cheryl Gilliam', 'code_postal': '1617'},
 {'nom': 'Colby Wynn', 'code_postal': '1617'},
 {'nom': 'Sacha Roberson', 'code_postal': '1617'},
 {'nom': 'Darrel Orr', 'code_postal': '1617'},
 {'nom': 'Mira Haley', 'code_postal': '1617'},
 {'nom': 'Bradley Mcbride', 'code_postal': '1617'},
 {'nom': 'Tanya Simmons', 'code_postal': '16213'},
 {'nom': 'Zeus Schwartz', 'code_postal': '16213'},
 {'nom': 'Joshua Hobbs', 'code_postal': '16213'},
 {'nom': 'MacKensie Herman', 'code_postal': '16213'},
 {'nom': 'Guy Harvey', 'code_postal': '16213'},
 {'nom': 'Lawrence May', 'code_postal': '16213'},

In [124]:
dict_employee[0]['nom']

'Cole Richard'

In [125]:
def list_employe (code_postal):
    list_employee = []

    for employe in range (len(dict_employee)):
        if dict_employee[employe]['code_postal'] == code_postal:
            list_employee.append(dict_employee[employe]['nom'])
    return list_employee

In [126]:
list_employe('01779')

['Cole Richard',
 'Lev Burgess',
 'Gillian Mccarthy',
 'Jarrod Webb',
 'Jorden Gibbs',
 'Wynter Duffy',
 'Kyra Sampson',
 'Yuli Trujillo',
 'Hiroko Tillman',
 'Kai Duffy',
 'Whoopi Compton',
 'Harlan Roman',
 'Lars Charles',
 'Lucian Hurst',
 'Megan Mooney',
 'Shoshana James',
 'Macaulay Salinas']

In [127]:
df_code_postal = pd.DataFrame(code_postal)

df_code_postal = df_code_postal.rename(columns={0:"code_postal"})

df_code_postal

    code_postal
0         24-13
1       G27 7HT
2       7443 YD
3     93956-418
4        977145
..          ...
245      183227
246        8563
247       21354
248        4460
249        7363

[250 rows x 1 columns]

In [128]:
df_code_postal['list_employe'] = df_code_postal['code_postal'].apply(lambda x : list_employe(x))

df_code_postal['employe_choice'] = "a"

df_code_postal

,code_postal,list_employe,employe_choice
0,24-13,"[Brady Manning, Amir Rodriguez, Ocean Blankens...",a
1,G27 7HT,"[Emily Richardson, Kenyon Bonner, Mohammad Huf...",a
2,7443 YD,"[Ahmed Osborn, Cyrus Ellis, Rhoda Larsen, Alex...",a
3,93956-418,"[Bianca Hodge, Elijah Mendez, Madison Willis, ...",a
4,977145,"[Alea Hyde, Dalton Tanner, Buckminster Carter,...",a
...,...,...,...
245,183227,"[Quinn Murphy, Mikayla Hoover, Chanda Harringt...",a
246,8563,"[Armand Larson, Justine Phillips, Rae Riggs, S...",a
247,21354,"[Donovan Albert, Beverly Diaz, Odessa Foley, T...",a
248,4460,"[Britanney Hudson, Basia Hyde, MacKenzie Compt...",a
249,7363,"[Callie Sharpe, Ebony Williams, Raymond Blake,...",a

In [129]:
print(df_code_postal.list_employe[0])

['Brady Manning', 'Amir Rodriguez', 'Ocean Blankenship', 'Nelle Slater', 'Paul Valdez', 'Colin Kidd', 'Carly Tillman', 'Wynne Savage', 'Angela Jones', "Hedwig O'Neill", 'Lamar Martin', 'Neil Edwards', 'Timon Cantrell', 'Cecilia Williams', 'Jana Wiley', 'Keely Swanson', 'Azalia Bender', 'Stewart Keller', 'Minerva Talley', 'Isaiah Jarvis', 'Kaitlin Gallegos', 'Quamar Price', 'Yvonne Holmes', 'Karen Craig', 'Alexis Buchanan']

In [130]:
len(df_code_postal.list_employe[0])

25

In [131]:
df_code_postal.list_employe[0][1]

'Amir Rodriguez'

In [132]:
df_code_postal = df_code_postal.set_index("code_postal")

df_code_postal

                                                  list_employe employe_choice
code_postal
24-13        [Brady Manning, Amir Rodriguez, Ocean Blankens...              a
G27 7HT      [Emily Richardson, Kenyon Bonner, Mohammad Huf...              a
7443 YD      [Ahmed Osborn, Cyrus Ellis, Rhoda Larsen, Alex...              a
93956-418    [Bianca Hodge, Elijah Mendez, Madison Willis, ...              a
977145       [Alea Hyde, Dalton Tanner, Buckminster Carter,...              a
...                                                        ...            ...
183227       [Quinn Murphy, Mikayla Hoover, Chanda Harringt...              a
8563         [Armand Larson, Justine Phillips, Rae Riggs, S...              a
21354        [Donovan Albert, Beverly Diaz, Odessa Foley, T...              a
4460         [Britanney Hudson, Basia Hyde, MacKenzie Compt...              a
7363         [Callie Sharpe, Ebony Williams, Raymond Blake,...              a

[250 rows x 2 columns]

In [133]:
df_code_postal.list_employe['24-13']

['Brady Manning',
 'Amir Rodriguez',
 'Ocean Blankenship',
 'Nelle Slater',
 'Paul Valdez',
 'Colin Kidd',
 'Carly Tillman',
 'Wynne Savage',
 'Angela Jones',
 "Hedwig O'Neill",
 'Lamar Martin',
 'Neil Edwards',
 'Timon Cantrell',
 'Cecilia Williams',
 'Jana Wiley',
 'Keely Swanson',
 'Azalia Bender',
 'Stewart Keller',
 'Minerva Talley',
 'Isaiah Jarvis',
 'Kaitlin Gallegos',
 'Quamar Price',
 'Yvonne Holmes',
 'Karen Craig',
 'Alexis Buchanan']

In [134]:
def select_employe (code):
    return df_code_postal.list_employe[code][rd.randint(0, len(df_code_postal.list_employe[code])-1)]

In [135]:
select_employe("24-13")

'Brady Manning'

In [136]:
df_employes_copy = df_employes_copy.set_index("nom")

df_employes_copy

,adresse,experience,poste,note,id_employee,code_postal
nom,,,,,,
Kenneth Snow,Ap #109-9179 Quisque Rd.,4/5/2004,cuisinier,0.0,0,43042
Maia Garcia,606 Odio. Ave,3/5/2010,cuisinier,1.0,1,164486
Shannon Mooney,"Ap #985-7190 Vulputate, Road",7/9/2020,cuisinier,3.0,2,776532
Tatyana Pace,Ap #344-5490 Pellentesque Avenue,26/11/2007,cuisinier,0.0,3,37815
Indira Vega,152-5825 Urna Rd.,16/4/2006,cuisinier,9.0,4,9318
...,...,...,...,...,...,...
Caldwell Salinas,Ap #252-1766 Mollis St.,10/8/2017,cuisinier,6.0,3640,164486
Cally Burton,290-9064 Sed Rd.,11/11/2015,cuisinier,5.0,3641,3725
Irma Mccall,Ap #777-9961 Elementum Rd.,4/9/2007,cuisinier,5.0,3642,327537
Charity Humphrey,Ap #234-705 Faucibus Av.,20/12/2008,cuisinier,2.0,3643,282669
Wanda Sullivan,"P.O. Box 959, 5947 Volutpat. Av.",31/5/2019,cuisinier,7.0,3644,6479

In [137]:
df_employes_copy.id_employee["Kenneth Snow"]

0

In [138]:
df_ticket['vendeur'] = df_ticket['code_postal'].apply(lambda x : select_employe(x))

df_ticket

,id_bill,prix_total,moyen_paiement,borne,code_postal,id_vendeur,vendeur
0,0,33.24,cb,1,547166,0,Evangeline Padilla
1,1,105.56,espece,0,42763,0,Samantha Roman
2,2,64.91,cb,1,8876 JU,0,Demetria Bruce
3,3,55.01,espece,0,87406,0,Kane Craft
4,4,69.50,cb,0,253842,0,Sybill Petty
...,...,...,...,...,...,...,...
9995,9995,78.25,espece,0,53782,0,Leonard Skinner
9996,9996,52.04,cb,0,6738,0,George Bernard
9997,9997,70.61,cb,0,7819,0,Aimee Rosario
9998,9998,65.08,cb,0,8481 KH,0,Dylan Stout
9999,9999,63.06,espece,0,604113,0,Sandra Cantu

In [139]:
df_ticket["id_vendeur"] = df_ticket['vendeur'].apply(lambda x : df_employes_copy.id_employee[x])

df_ticket

,id_bill,prix_total,moyen_paiement,borne,code_postal,id_vendeur,vendeur
0,0,33.24,cb,1,547166,2704,Evangeline Padilla
1,1,105.56,espece,0,42763,20,Samantha Roman
2,2,64.91,cb,1,8876 JU,2548,Demetria Bruce
3,3,55.01,espece,0,87406,1545,Kane Craft
4,4,69.50,cb,0,253842,1528,Sybill Petty
...,...,...,...,...,...,...,...
9995,9995,78.25,espece,0,53782,232,Leonard Skinner
9996,9996,52.04,cb,0,6738,1720,George Bernard
9997,9997,70.61,cb,0,7819,490,Aimee Rosario
9998,9998,65.08,cb,0,8481 KH,422,Dylan Stout
9999,9999,63.06,espece,0,604113,1686,Sandra Cantu

In [140]:
del df_ticket['vendeur']

df_ticket

      id_bill  prix_total moyen_paiement  borne code_postal id_vendeur
0           0       33.24             cb      1      547166       2704
1           1      105.56         espece      0       42763         20
2           2       64.91             cb      1     8876 JU       2548
3           3       55.01         espece      0       87406       1545
4           4       69.50             cb      0      253842       1528
...       ...         ...            ...    ...         ...        ...
9995     9995       78.25         espece      0       53782        232
9996     9996       52.04             cb      0        6738       1720
9997     9997       70.61             cb      0        7819        490
9998     9998       65.08             cb      0     8481 KH        422
9999     9999       63.06         espece      0      604113       1686

[10000 rows x 6 columns]

In [141]:
# for ticket in range(len(df_ticket)):
#     if df_ticket.borne[ticket] == 1:
#         df_ticket.id_vendeur[ticket] = 999999

# df_ticket

In [142]:
df_ticket.id_vendeur.value_counts().dtype

dtype('int64')

In [143]:
df_ticket.id_vendeur.astype(int)

ValueError: setting an array element with a sequence.

In [ ]:
df_ticket.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_bill         10000 non-null  int64
 1   prix_total      10000 non-null  float64
 2   moyen_paiement  10000 non-null  object
 3   borne           10000 non-null  int64
 4   code_postal     10000 non-null  object
 5   id_vendeur      10000 non-null  object
dtypes: float64(1), int64(2), object(3)
memory usage: 468.9+ KB

In [ ]:
df_ticket.to_sql(name='Bill', con=engine, if_exists = 'append', index=False)

2022-12-12 09:04:18,946 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Bill")
2022-12-12 09:04:18,947 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-12 09:04:18,954 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-12 09:04:19,003 INFO sqlalchemy.engine.Engine INSERT INTO "Bill" (id_bill, prix_total, moyen_paiement, borne, code_postal, id_vendeur) VALUES (?, ?, ?, ?, ?, ?)
2022-12-12 09:04:19,004 INFO sqlalchemy.engine.Engine [generated in 0.03958s] ((0, 49.96, 'cb', 0, '65814-592', 2143), (1, 67.95, 'espece', 0, '1617', 105), (2, 20.05, 'espece', 0, '327537', 1874), (3, 56.07999999999999, 'cb', 0, '4430', 1144), (4, 75.52000000000001, 'cb', 1, '3685 KV', 52), (5, 51.99000000000001, 'cb', 1, '0557', 2), (6, 46.629999999999995, 'cb', 1, '66182-047', 599), (7, 43.989999999999995, 'cb', 1, '93870', 3400)  ... displaying 10 of 10000 total bound parameter sets ...  (9998, 32.510000000000005, 'cb', 1, '9918 DE', 3339), (9999, 92.35, 'espece', 0, '762070', 1300))
2022-12-12 09:04:19,008 INFO sqlalchemy.engine.Engine ROLLBACK

InterfaceError: (sqlite3.InterfaceError) Error binding parameter 5 - probably unsupported type.
[SQL: INSERT INTO "Bill" (id_bill, prix_total, moyen_paiement, borne, code_postal, id_vendeur) VALUES (?, ?, ?, ?, ?, ?)]
[parameters: ((0, 49.96, 'cb', 0, '65814-592', 2143), (1, 67.95, 'espece', 0, '1617', 105), (2, 20.05, 'espece', 0, '327537', 1874), (3, 56.07999999999999, 'cb', 0, '4430', 1144), (4, 75.52000000000001, 'cb', 1, '3685 KV', 52), (5, 51.99000000000001, 'cb', 1, '0557', 2), (6, 46.629999999999995, 'cb', 1, '66182-047', 599), (7, 43.989999999999995, 'cb', 1, '93870', 3400)  ... displaying 10 of 10000 total bound parameter sets ...  (9998, 32.510000000000005, 'cb', 1, '9918 DE', 3339), (9999, 92.35, 'espece', 0, '762070', 1300))]
(Background on this error at: https://sqlalche.me/e/14/rvf5)